{
  "Recent Viewed Item" : {
    "IUKcsosLqFhWyuOtagcogza25QJ2" : {
      "Aloo puri" : {
        "-MiKPTfanjUukItAZCTb" : {
          "chefName" : "Rita ben",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large bowl take 2 cup of wheat flour and 2 tbsp rava.\n\nalso add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala, ¼ tsp ajwain, 1 tsp kasuri methi and ½ tsp salt.\n\nmix well making sure all the spices are well combined.\n\nfurther, add mashed 3 potatoes and mix well.\n\nadd water and start to knead the dough.\n\nmake sure to knead the dough adding water as required. also note that aloo will release the moisture, so add water accordingly.\n\nknead to a smooth and tight dough.\n\nalso, add 2 tbsp oil and knead the dough.\n\nnow take a ball and roll using a rolling pin.\n\nroll to slightly thick thickness.\n\ndrop the rolled dough into the hot oil.\n\npress until the puri puffs up and splash oil to puff up fully.\n\nflip over and fry until it turns golden brown.\n\nfinally, drain off the aloo poori and is ready to enjoy with sabzi or pickle.",
          "recipeDuration" : "40 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FAloo%20puri%2FImageimage%3A151109?alt=media&token=b5015fec-140b-4e7c-ae62-acbef28c1010",
          "recipeIngredients" : "3 aloo / potato boiled\n\n2 cup wheat flour / atta\n\n2 tbsp rava / semolina fine\n\n¼ tsp turmeric\n\n½ tsp chilli powder\n\n½ tsp cumin powder\n\n½ tsp garam masala\n\n¼ tsp ajwain / carom seeds\n\n1 tsp kasuri methi crushed\n\n½ tsp salt\n\nwater for kneading\n\noil for frying",
          "recipeName" : "Aloo puri",
          "recipeType" : "Dinner"
        }
      },
      "Baked Ricotta Cake" : {
        "-MiKY9GKFq_c1roXvMsk" : {
          "chefName" : "Sunny",
          "countryName" : "United Arab Emirates",
          "recipeDirections" : "1.To make the pastry, place butter and 3/4 cup (165g) sugar in a stand mixer with the paddle attachment and beat until smooth. Beat in 1 egg until well combined. Fold in flour, baking powder and a pinch of salt. Cut one-third of the dough, flatten into a rectangle and enclose in plastic wrap. Shape the larger piece into a rectangle and enclose in plastic wrap. Chill both blocks of pastry for 2 hours.\n2.Preheat oven to 200°C. Grease a 20cm x 30cm x 5cm rectangular lamington pan and line with baking paper, leaving a 3cm overhang. Roll larger piece of pastry out between 2 sheets of lightly floured baking paper to 5mm thick. Use pastry to line the base of prepared pan, trimming the edges to fit snugly, then prick all over with a fork. Place pan on a baking tray and bake for 20-25 minutes until base is golden. Remove from oven and cool completely.\n3.Roll small pastry rectangle out between 2 sheets of floured baking paper into a 3mm-thick rectangle. Cut into long 6cm- wide strips to line the sides of the pan. Refrigerate while you make the filling.\n4.Reduce oven to 160°C. To make filling, lightly beat remaining 4 eggs. Place ricotta and cream cheese in a stand mixer with the paddle attachment and beat until smooth. Beat in vanilla, remaining 1 cup (220g) sugar and eggs to combine.\n5.Line sides of the pan with 6cm strips of pastry, gently pressing them onto top of cooked base to create a join (the pastry is soft, but will come together when cooked). Use a small sharp knife to trim the pastry so it’s flush with the top of the pan. Spoon filling into the pastry shell. Place pan on a baking tray and bake for 1 hour 20 minutes or until edges are set with a very slight wobble in the centre (it may crack a little, but will settle when it cools). Turn off the oven and set the door ajar with a wooden spoon. Leave the cake to cool completely in the oven, then chill for 6 hours to set. Use the baking paper overhang to carefully lift cake out of the pan. Dust cake with icing sugar to serve.",
          "recipeDuration" : "2 Hours",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBaked%20Ricotta%20Cake%2FImageimage%3A134158?alt=media&token=fdd59b8e-eef6-485e-854d-0c0e4648e550",
          "recipeIngredients" : "200g unsalted butter, chilled, chopped\n1 3/4 cup (385g) caster sugar\n5 eggs\n3 cups (450g) plain flour\n1 tsp baking powder\n700g fresh ricotta\n500g cream cheese, at room temperature\n2 tsp vanilla extract\nPure icing sugar, to dust",
          "recipeName" : "Baked Ricotta Cake",
          "recipeType" : "Desserts"
        }
      },
      "Coconut pudding" : {
        "-MiKZPMJvX5rkBEk2Ms-" : {
          "chefName" : "Sahil",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a mixi take 2 cup coconut, 3 pods cardamom.\n\nadd 500 ml warm water and blend well.\n\nstrain the coconut milk using the muslin cloth. use first extract coconut milk or you can use 500 ml coconut milk from the tin.\n\nnow take coconut milk into a large bowl. add 5 tbsp cornflour, ½ cup sugar and pinch salt.\n\nwhisk and mix well making sure there are no lumps. in place of cornflour you can also use custard powder.\n\ntransfer the mixture to a large kadai keeping the flame on low.\n\nkeep stirring the mixture until it thickens.\n\nthe mixture starts to thicken and turns glossy, that is the right consistency. over cooking will make hard pudding. undercooking will make it sticky and difficult to set.\n\npour the mixture into the moulds greased with oil.\n\ncool completely and refrigerate for 2 hours to set completely.\n\nfinally, enjoy coconut pudding topped with mango puree.",
          "recipeDuration" : "30 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCoconut%20pudding%2FImageimage%3A151111?alt=media&token=2ff06e7c-b038-4a8a-bf01-d806c7b540e6",
          "recipeIngredients" : "2 cup coconut grated\n\n3 pods cardamom\n\n500 ml warm water\n\n5 tbsp cornflour\n\n½ cup sugar\n\npinch salt",
          "recipeName" : "Coconut pudding",
          "recipeType" : "Desserts"
        }
      },
      "Grilled sandwich" : {
        "-MiKR10c2va9Bxi7O0Zr" : {
          "chefName" : "Gauri Gupta",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large mixing bowl mash boiled potatoes.\n\nalso add in chopped onions.\n\nfurthermore, add crumbled paneer.\n\nalso add chilli powder, chaat masala, mixed herbs and salt.\n\nmix and mash the potatoes well.\n\nfurther take bread slices and spread green chutney and tomato sauce.\n\nspread the generous amount of prepared potato stuffing.\n\ncover with the other bread slice and press gently.\n\nthen grill or toast on tawa adding some butter.\n\nspread butter on both the outer sides of bread to make sandwich more crispy and golden.\n\nfurthermore, close the griller and grill till the cheese melts and bread turn golden brown.\n\nnow cut the bread into half and serve.\n\nfinally, serve hot or pack for kids lunch box.",
          "recipeDuration" : "20 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FGrilled%20sandwich%2FImageimage%3A151110?alt=media&token=459cf919-80fd-4232-b3be-9540036ef014",
          "recipeIngredients" : "2 small sized potato boiled and pealed\n\n½ onion finely chopped\n\n½ cup paneer / cottage cheese crumbled\n\nsalt to taste\n\n½ tsp kashmiri chilli powder\n\n¼ tsp chaat masala\n\nbutter to grill\n\n¼ tsp mixed herbs thyme, rosemary, marjoram, basil, oregano, sage\n\n4 bread slices\n\n2 tsp green chutney\n\n2 tsp tomato sauce",
          "recipeName" : "Grilled sandwich",
          "recipeType" : "Snacks"
        }
      },
      "Masala Tea" : {
        "-MiK6ULthV4JuBwBJ5_U" : {
          "chefName" : "Varsha",
          "countryName" : "India",
          "recipeDirections" : "Boil water\nAdd tea leaves and Mint leaves\nAdd sugar and boil it for 2 minutes\nAdd milk and wait for boil to come\nWhen you see boil add ginger in it\nBoil it for more 5 minutes and Masala Tea is ready\nServe it with Biscuits",
          "recipeDuration" : "10 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Tea%2FImageimage%3A134143?alt=media&token=bafae1c0-d00d-49b7-bcb5-ff5e4e9f4483",
          "recipeIngredients" : "1cup Milk\n1tbsp Tea leaves\n¼cup Water\n2tbsp Sugar\n½tbsp Ginger (Shredded)\n4 Mint leaves",
          "recipeName" : "Masala Tea",
          "recipeType" : "Breakfast"
        }
      },
      "Maska Bun" : {
        "-MiKY7G-_jEQDMSAQOcP" : {
          "chefName" : "Pranav",
          "countryName" : "Pakistan",
          "recipeDirections" : "• First Cut the bun into 2 parts horizontally\n\n• Spread the butter and Jam on both side",
          "recipeDuration" : "5 minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMaska%20Bun%2FImageimage%3A134149?alt=media&token=24281813-1462-4908-99a3-5b2a47e5c2f4",
          "recipeIngredients" : "• 1 bun\n• 2tbsp Butter\n• 2tbsp Mix fruit jam",
          "recipeName" : "Maska Bun",
          "recipeType" : "Brunch"
        }
      },
      "Sahi Paratha" : {
        "-MiK76a9L0ZWBKM221Ft" : {
          "chefName" : "Kunak khanna",
          "countryName" : "India",
          "recipeDirections" : "how to knead dough for paratha:\n\nfirstly, in a large bowl take 3 cup of wheat flour, ¼ tsp ajwain and ½ tsp salt.\n\nmix well combining all the ingredients well.\n\nnow add warm milk and start to knead the dough. kneading the dough with milk helps to make soft paratha and is also flavourful.\n\nadd milk as required and knead to a smooth and soft dough.\n\ngrease the dough with oil, cover and rest for 20 minutes.\n\nhow to make aloo stuffing for paratha:\n\nin a large bowl take 3 potato, ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala, 1 tsp aamchur, ¼ tsp ajwain and ½ tsp salt.\n\nalso add 3 chilli, ½ tsp ginger paste and 2 tbsp coriander.\n\nmix well making sure everything is well combined. keep aside.\n\nhow to prepare the paratha:\n\nafter the dough has rested for 20 minutes, knead slightly and pinch a ball sized dough.\n\ndust the dough with wheat flour and roll slightly.\n\nplace a ball sized aloo masala in the centre and then top with 2 tbsp chopped cashew and raisins.\n\nalso top with 3 tbsp paneer  and pinch of garam masala.\n\ntake the edge and start pleating bringing it to the centre.\n\nalso join the pleats together and secure tight pinching off excess dough.\n\nsprinkle some wheat flour and roll slightly thick.\n\non a hot tawa place the rolled paratha and cook for a minute.\n\nfurthermore, flip the paratha when the base is partly cooked (after a minute).\n\nalso, brush oil / ghee and press slightly. flip again once or twice till both the sides are cooked properly.\n\nfinally, serve hot shahi paratha with butter, raita or pickle.",
          "recipeDuration" : "30 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSahi%20Paratha%2FImageimage%3A151106?alt=media&token=e65961e0-8655-4cd0-b6c3-766c051a004f",
          "recipeIngredients" : "for dough:\n\n3 cup wheat flour\n\n¼ tsp ajwain / carom seeds\n\n½ tsp salt\n\nmilk for kneading\n\n2 tsp oil for greasing\n\nfor stuffing:\n\n3 potato / aloo boiled & grated\n\n¼ tsp turmeric\n\n½ tsp chilli powder\n\n½ tsp cumin powder\n\n½ tsp garam masala\n\n1 tsp aamchur\n\n¼ tsp ajwain / carom seeds\n\n½ tsp salt\n\n3 chilli finely chopped\n\n½ tsp ginger paste\n\n2 tbsp coriander finely chopped",
          "recipeName" : "Sahi Paratha",
          "recipeType" : "Brunch"
        }
      },
      "classic caesar" : {
        "-MiJ9x2DdySaKEXLWVAq" : {
          "chefName" : "Tejas Don",
          "countryName" : "Canada",
          "recipeDirections" : "Wet the rim of a cocktail glass with the lime wedge; set aside for garnish. Place celery salt in a small dish, and press the rim of the glass into the salt to coat. Add ice to the glass.\n\n\nPour vodka, Worcestershire sauce, and hot pepper sauce over the ice; top with tomato-clam juice. Garnish with lime wedge and celery stick. Serve with a straw.",
          "recipeDuration" : "5 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fclassic%20caesar%2FImageimage%3A151112?alt=media&token=4579fd58-85ec-4d5a-930c-f0b8b15c1fa4",
          "recipeIngredients" : "1 lime wedge\n\n1 tablespoon celery salt, or as needed\n\nice cubes, as needed\n\n1 fluid ounce vodka\n\n1 dash Worcestershire sauce, or to taste\n\n1 dash hot pepper sauce (such as Tabasco®), or to taste\n\n8 fluid ounces tomato and clam juice cocktail (such as Clamato®)\n\n1 celery stick",
          "recipeName" : "classic caesar",
          "recipeType" : "Drinks"
        }
      },
      "idli" : {
        "-MiKR8OsuL_HrNFHciw4" : {
          "chefName" : "Anna Khan",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large bowl take 1 cup urad dal and rinse well.\n\nsoak in water for 4 hours.\n\nafter soaking for 4 hours, transfer the dal to mixi jar. you can alternatively grind in a grinder.\n\ngrind to smooth and fluffy batter adding water as required.\n\ntransfer the batter to a large bowl.\n\nnow in another bowl take 2 cups rice rava and rinse a couple of times.\n\nsqueeze off the water from the rava and transfer it to the urad dal batter bowl.\n\nmix well using your hand. this helps to aid fermentation.\n\nnow cover and keep in a warm place for 8 hours for fermentation.\n\nafter 8 hours, the batter has well fermented. mix gently.\n\nadd 1 tsp salt and mix making sure the salt is well combined.\n\nnow to prepare the cups from banana leaf, cut the banana leaf into a round shape.\n\nand using a stapler, pin it up into 4 sides forming a cup.\n\nplace the cup in the steamer and pour the batter into the molds.\n\ncover and steam for 20 minutes or until the idlis are cooked well.\n\nfinally, enjoy soft idli with chutney or sambar.",
          "recipeDuration" : "20 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151099?alt=media&token=c770198a-b7c1-4ef3-ae85-52383f1fabae",
          "recipeIngredients" : "1 cup urad dal\n2 cup rice rava / idli rava\n1 tsp salt\nbanana leaves to make cups",
          "recipeName" : "idli",
          "recipeType" : "Breakfast"
        }
      }
    },
    "JuWdaR5kewMTa2oaSO0p4GOStVu1" : {
      "Badami Milk" : {
        "-MiKC2gOc9CvU7z7QQvN" : {
          "chefName" : "Jagjith",
          "countryName" : "India",
          "recipeDirections" : "Soak almond in hot water for 20 minutes. After 20 minutes, discard the water and then remove the skin from each almond. It will come off easily.\nTransfer blanched almonds with ¼ cup milk to a blender. Blend to a smooth paste. Set it aside.\nNow transfer the remaining milk to a pan and put in on medium-high heat.\nAs the milk warms up, take out 1 tablespoon of the warm milk from the pan into a small bowl and add crushed saffron strands to it. Set aside.\nOnce the milk in the pan comes to a boil, add the prepared almond paste to it. Stir to combine.\nLower the heat to low medium and let the milk simmer for 15 to 20 minutes. Stir often so that milk doesn’t get stuck to the bottom of the pan. The raw smell of almonds should disappear completely.\nAdd in the saffron milk that you had set aside.\nThen add the sugar and stir until it’s dissolved.\nFinally add in the crushed cardamom seeds. You may also add rose water (if using) at this point. Mix everything together and turn off the heat.\nServe badam milk hot or cold. I personally love it chilled.",
          "recipeDuration" : "35 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBadami%20Milk%2FImageimage%3A91?alt=media&token=c7819763-f21a-4e3b-93e9-9b18afc7903f",
          "recipeIngredients" : "Serves 4 People\n35 almonds 40 grams\n1 liter whole milk\ngenerous pinch saffron dissolved in 1 tablespoon milk\n4-6 tablespoons granulated white sugar 50-75 grams, or to taste\n5-6 green cardamom pods seeds removed & crushed using a mortar and pestle\n1/2 teaspoon rose water optional",
          "recipeName" : "Badami Milk",
          "recipeType" : "Drinks"
        }
      },
      "Poha Rice" : {
        "-MiJl1qoSkmmtwpBI6oh" : {
          "chefName" : "Vyshu",
          "countryName" : "India",
          "recipeDirections" : "To a strainer, add flattened rice (poha). Rinse it under running water until it turns soft. To check if it's done, press a flake between your thumb and index finger, it should break easily.\nAdd turmeric and 1/2 teaspoon salt to the poha and toss to combine. Set it aside while you make the tempering in the pan.\nHeat oil in a pan on medium heat. Once the oil is hot, add the mustard seeds and let them pop.\nThen add the peanuts and saute for a minute or two until they start turning brown.\nThen add the chopped onion, green chili and curry leaves. Cook for 2 minutes until the onions soften.\nAdd the green peas (which had been soaked in warm water for 10 minutes prior) and mix. Cook for 2 minutes until raw smell of peas goes away.\nThen add in the rinsed poha and toss to combine. Taste test some poha and if it feels dry, sprinkle little water all over (I usually do that). Cook for 1-2 minutes.  Also tastes test and add more salt as needed at this point (I added around 1/8 teaspoon).\nAlso add the sugar (if using) and cilantro.\nAnd then cover the pan with a lid and turn heat to low. Let it be like that for 2 minutes. Then turn off the heat.\nSqueeze in some fresh lemon juice. Garnish poha with more cilantro and sev and serve with a cuppa chai.",
          "recipeDuration" : "20 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPoha%20Rice%2FImageimage%3A63?alt=media&token=69ca220b-fdde-4da9-859a-107ec9d46761",
          "recipeIngredients" : "Serves 2 people\n1.5 cups poha 114 grams, use thick poha\n1/4 teaspoon turmeric\n1/2 teaspoon + 1/8 teaspoon salt divided, adjust to taste\n1/3 cup green peas I used frozen, soaked in warm water for 10 minutes\n2 teaspoons oil 10 ml, I used avocado oil\n1/2 teaspoon mustard seeds\n1.5 tablespoons raw peanuts\n1 small red onion chopped\n1 green chili chopped\n10-12 curry leaves\n1/4 teaspoon sugar optional\n1 tablespoon chopped cilantro + more to garnish\n1/2 lemon juice of\nsev to garnish",
          "recipeName" : "Poha Rice",
          "recipeType" : "Breakfast"
        }
      },
      "Pot Southwestern Pasta" : {
        "-MiK7M8RHluQTB6_GGf1" : {
          "chefName" : "Tiwari",
          "countryName" : "India",
          "recipeDirections" : "Press the saute button on the instant pot. And then press the adjust button to set saute to \"less\". Once it displays hot, add the olive oil. Then add the garlic, jalapeño, red onion and saute for 4 to 5 minutes until soft and fragrant.\nAdd the black beans, sweet corn, red pepper. Then add the taco seasoning and mix.\nStir in 1 cup water, followed by pasta and pasta sauce. Do not stir after adding the pasta sauce. You can spread it though over the pasta using a spatula.\nAdd salt and close the pot. Press the manual or pressure cook button and cook on high pressure for 6 minutes (I will probably do 4 minutes if using regular pasta in place of whole wheat).\nLet the pressure release naturally for 5 minutes and then do a quick pressure release.\nOpen the pot and stir everything together. Add the cilantro and mix. Also add the cheese and stir until it melts.\nCover the pasta with a lid for 2 to 3 minutes for all the flavors to mix in together after adding the cheese.\nServe southwestern pasta with more cilantro and avocados!\nStove-top Instructions\nBoil pasta according to instructions on the package. You can reserve some pasta water (around 1/4 cup) to thin out the sauce later.\nHeat olive oil in a pan on medium heat. Cook the garlic, onion, jalapeno for 4 to 5 minutes. Then add the beans, corn and pepper. Cook for 1 to 2 minutes and then add the taco seasoning. Cook for 30 seconds.\nAdd in the boiled pasta and pasta sauce. Mix everything together. You can add reserved water from boiling pasta at this point if the sauce looks thick.\nAdd the cilantro and cheese. Stir until the cheese melts. Serve pasta with cilantro and avocados.",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPot%20Southwestern%20Pasta%2FImageimage%3A87?alt=media&token=d408fdab-58b6-4bd3-b8a2-4bc0bd21f8b5",
          "recipeIngredients" : "Serves 4 People\n1.5 tablespoons olive oil 22 ml\n3-4 large garlic cloves chopped\n1/2 jalapeño de-seeded and chopped\n1 small red onion chopped\n1 cup black beans from a can\n1/3 cup sweet corn I used frozen corn\n1 medium red pepper sliced\n2 teaspoons taco seasoning or to taste\n1 cup water 8 oz\n8 oz penne pasta I used whole wheat, around 3 cups penne pasta\n1.5 cups pasta sauce 12 oz, I used Rao's marinara sauce\n1/2 teaspoon salt or to taste\n1-2 tablespoons chopped cilantro + more to garnish\n3/4 cup Mexican cheese blend shredded\ndiced avocados to serve, optional",
          "recipeName" : "Pot Southwestern Pasta",
          "recipeType" : "Dinner"
        }
      }
    },
    "NuxPL1bcAuUWmjpuEoVGC4vjjKS2" : {
      "Masala Tea" : {
        "-MiKagNvOn73y6HVkZ2a" : {
          "chefName" : "Varsha",
          "countryName" : "India",
          "recipeDirections" : "Boil water\nAdd tea leaves and Mint leaves\nAdd sugar and boil it for 2 minutes\nAdd milk and wait for boil to come\nWhen you see boil add ginger in it\nBoil it for more 5 minutes and Masala Tea is ready\nServe it with Biscuits",
          "recipeDuration" : "10 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Tea%2FImageimage%3A134143?alt=media&token=bafae1c0-d00d-49b7-bcb5-ff5e4e9f4483",
          "recipeIngredients" : "1cup Milk\n1tbsp Tea leaves\n¼cup Water\n2tbsp Sugar\n½tbsp Ginger (Shredded)\n4 Mint leaves",
          "recipeName" : "Masala Tea",
          "recipeType" : "Breakfast"
        }
      },
      "Pancakes" : {
        "-MiKadGgMqDGgRkOyKJS" : {
          "chefName" : "Ratan",
          "countryName" : "Canada",
          "recipeDirections" : "In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg.\n\nIn another bowl, beat the eggs and then whisk in the milk and vanilla.\n\nMelt the butter in a large cast iron skillet or griddle over medium heat.\n\nWhisk the butter into the milk mixture. Add the wet ingredients to the flour mixture, and whisk until a thick batter is just formed.\n\nKeeping the skillet at medium heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make 1 or 2 more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed.\n\nProcedure for adding fruit to pancakes: Once the bubbles break the surface of the pancakes, scatter the surface with sliced or diced fruit, or chocolate chips, nuts, etc. Flip with a spatula and cook for 1 minute more, being careful not to burn toppings",
          "recipeDuration" : "30 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPancakes%2FImageimage%3A39758?alt=media&token=55e10f1d-9548-4d75-a350-aa48ae01c5a6",
          "recipeIngredients" : "1 1/2 cups all-purpose flour\n\n3 tablespoons sugar\n\n1 tablespoon baking powder\n\n1/4 teaspoon salt\n\n1/8 teaspoon freshly ground nutmeg\n\n2 large eggs, at room temperature\n\n1 1/4 cups milk, at room temperature\n\n1/2 teaspoon pure vanilla extract\n\n3 tablespoons unsalted butter, plus more as needed",
          "recipeName" : "Pancakes",
          "recipeType" : "Breakfast"
        }
      },
      "Upma Rava" : {
        "-MiKamJyaUua4mHrkCp3" : {
          "chefName" : "Niharika",
          "countryName" : "India",
          "recipeDirections" : "Roast sooji on medium heat until fragrant, around 5 to 6 minutes, stirring continuously. Sooji shouldn't turn brown from bottom so be careful. Remove sooji from pan and transfer it to another bowl.\nYou can do this step of roasting sooji in advance and save time for busy mornings.\nTo the same pan now add 1.5 tablespoons oil on medium heat. Add mustard seeds and let them pop.\nThen add hing, cashews, chana & urad dal (which I soaked in water for 10 mins), ginger and saute for 1 minute until they start changing color.\nAdd onion, green chili and curry leaves. Cook for 2 minutes until the onions are soft. \nThen add the green peas and stir (I used frozen peas and soaked them in warm water for 10 mins before adding to the pan). Cook for 2 minutes until the raw smell of peas goes away.\nAdd 3 cups of water. Then add salt, chopped cilantro and lemon juice and mix well. You may also add sugar if you like little sweet taste in your upma. You may add 1/2 teaspoon sugar. I did not add any.\nNow let the water come to a boil. Once the water comes to a boil, start adding the roasted sooji little at a time.\nMix sooji after each addition in one direction with a wooden spatula. \nAdd all the sooji in similar way, little by little until all of it is absorbed by water.\nThen cover the pan with lid and set heat to low. Let it remain like that for 2 mins.\nRemove lid and add 1 teaspoon ghee. This is optional but recommended. Turn off the heat.\nMix the ghee with the upma and close lid again for few seconds. Remove the lid, fluff upma with a fork.\nServe upma warm with a side of coconut chutney!",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FUpma%20Rava%2FImageacc%3D1%3Bdoc%3D581?alt=media&token=ed3c14c4-3497-4a69-8146-a100420eb5ad",
          "recipeIngredients" : "Serves 3 people\n1 cup sooji/rava semolina, 182 grams\n1.5 tablespoons oil or can use ghee\n1 teaspoon mustard seeds\ngenerous pinch of hing also known as asafetida\n7-8 raw cashews broken\n1 teaspoon chana dal soaked in water for 10 mins\n1 teaspoon urad dal dhuli soaked in water for 10 mins\n1 teaspoon chopped ginger\n1 small red onion chopped, around 70 grams\n1 green chili chopped, or to taste\n12 curry leaves\n3 tablespoons green peas frozen\n3 cups water 24 oz\n3/4 teaspoon salt or to taste\n1 tablespoon chopped cilantro + more to garnish\n1 teaspoon lemon juice\n1 teaspoon ghee\nlemon wedges to serve",
          "recipeName" : "Upma Rava",
          "recipeType" : "Breakfast"
        }
      }
    },
    "vwkNUIMU73QU2BIaltsXMcrSt0A2" : {
      "Aloo puri" : {
        "-MiJCrKSqaG7_-PIWMls" : {
          "chefName" : "Rita ben",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large bowl take 2 cup of wheat flour and 2 tbsp rava.\n\nalso add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala, ¼ tsp ajwain, 1 tsp kasuri methi and ½ tsp salt.\n\nmix well making sure all the spices are well combined.\n\nfurther, add mashed 3 potatoes and mix well.\n\nadd water and start to knead the dough.\n\nmake sure to knead the dough adding water as required. also note that aloo will release the moisture, so add water accordingly.\n\nknead to a smooth and tight dough.\n\nalso, add 2 tbsp oil and knead the dough.\n\nnow take a ball and roll using a rolling pin.\n\nroll to slightly thick thickness.\n\ndrop the rolled dough into the hot oil.\n\npress until the puri puffs up and splash oil to puff up fully.\n\nflip over and fry until it turns golden brown.\n\nfinally, drain off the aloo poori and is ready to enjoy with sabzi or pickle.",
          "recipeDuration" : "40 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FAloo%20puri%2FImageimage%3A151109?alt=media&token=b5015fec-140b-4e7c-ae62-acbef28c1010",
          "recipeIngredients" : "3 aloo / potato boiled\n\n2 cup wheat flour / atta\n\n2 tbsp rava / semolina fine\n\n¼ tsp turmeric\n\n½ tsp chilli powder\n\n½ tsp cumin powder\n\n½ tsp garam masala\n\n¼ tsp ajwain / carom seeds\n\n1 tsp kasuri methi crushed\n\n½ tsp salt\n\nwater for kneading\n\noil for frying",
          "recipeName" : "Aloo puri",
          "recipeType" : "Dinner"
        }
      },
      "Apple Pie" : {
        "-MiJCt0HXExlEsfb3iTc" : {
          "chefName" : "Darshan",
          "countryName" : "United States",
          "recipeDirections" : "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\n\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust. Gently pour the sugar and butter liquid over the crust. Pour slowly so that it does not run off.\n\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.",
          "recipeDuration" : "90 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FApple%20Pie%2FImageimage%3A134159?alt=media&token=b5929a1e-e95a-4eab-b4f9-b249c19e037a",
          "recipeIngredients" : "1 recipe pastry for a 9 inch double crust pie\n\n½ cup unsalted butter\n\n3 tablespoons all-purpose flour\n\n¼ cup water\n\n½ cup white sugar\n\n½ cup packed brown sugar\n\n8 Granny Smith apples - peeled, cored and sliced",
          "recipeName" : "Apple Pie",
          "recipeType" : "Baking"
        }
      },
      "Chicken Parm Egg Rolls" : {
        "-MiJA1sie6DTLwLZnTyh" : {
          "chefName" : "Lalit",
          "countryName" : "Bulgaria",
          "recipeDirections" : "Place an egg roll wrapper on a clean surface in a diamond shape. Add 1 chicken tender half, a tablespoon marinara, a sprinkle of mozzarella, Parmesan, Italian seasoning, and basil. Wet corners slightly with water, then fold up bottom half and tightly fold in sides. Gently roll and seal tightly like a burrito. Repeat to make 11 more egg rolls.\nIn a large skillet over medium heat, heat 1/4” oil until it starts to shimmer. Add egg rolls and fry in batches until golden, 1 minute per side, adjusting heat as necessary. Transfer to a paper towel-lined plate to drain.\nGarnish egg rolls with Parmesan and serve with warm marinara for dipping.",
          "recipeDuration" : "30 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FChicken%20Parm%20Egg%20Rolls%2FImageimage%3A134157?alt=media&token=8cf68df3-d3b6-475b-bc06-6b550d94ab76",
          "recipeIngredients" : "12 egg roll wrappers\n6 chicken tenders, cooked according to package directions, halved lengthwise\n3/4 c. marinara, plus more for serving\n1 c. shredded mozzarella\n1/4 c. freshly grated Parmesan, plus more for garnish\n2 tsp. dried oregano (or Italian seasoning)\n1/3 c. freshly sliced basil \nCanola oil, for frying",
          "recipeName" : "Chicken Parm Egg Rolls",
          "recipeType" : "Appetisers"
        }
      },
      "Coconut pudding" : {
        "-MiJ8p8xZy9vtIdtTEGQ" : {
          "chefName" : "Sahil",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a mixi take 2 cup coconut, 3 pods cardamom.\n\nadd 500 ml warm water and blend well.\n\nstrain the coconut milk using the muslin cloth. use first extract coconut milk or you can use 500 ml coconut milk from the tin.\n\nnow take coconut milk into a large bowl. add 5 tbsp cornflour, ½ cup sugar and pinch salt.\n\nwhisk and mix well making sure there are no lumps. in place of cornflour you can also use custard powder.\n\ntransfer the mixture to a large kadai keeping the flame on low.\n\nkeep stirring the mixture until it thickens.\n\nthe mixture starts to thicken and turns glossy, that is the right consistency. over cooking will make hard pudding. undercooking will make it sticky and difficult to set.\n\npour the mixture into the moulds greased with oil.\n\ncool completely and refrigerate for 2 hours to set completely.\n\nfinally, enjoy coconut pudding topped with mango puree.",
          "recipeDuration" : "30 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCoconut%20pudding%2FImageimage%3A151111?alt=media&token=2ff06e7c-b038-4a8a-bf01-d806c7b540e6",
          "recipeIngredients" : "2 cup coconut grated\n\n3 pods cardamom\n\n500 ml warm water\n\n5 tbsp cornflour\n\n½ cup sugar\n\npinch salt",
          "recipeName" : "Coconut pudding",
          "recipeType" : "Desserts"
        }
      },
      "Dal Makhni" : {
        "-MiJ6w0BEHj-mhujkNfC" : {
          "chefName" : "Shah Rukh Khan",
          "countryName" : "Bangladesh",
          "recipeDirections" : "1. Wash and rinse urad dal (whole black lentil) and rajma (kidney beans) in a large bowl. Soak in 3 cups water overnight.\nIn the morning, drain the water in which the dal and rajma was soaked. Transfer the dal and rajma to a pressure cooker with 1 teaspoon salt. Add around 3.5 cups water. \nPressure cook on high-medium heat for 10 whistles, then lower the heat to low-medium and cook for another 10 minutes. In total around 15 to 20 whistles.\nLet the pressure release naturally. The dal and rajma should be completely cooked and you should be able to mash them with your fingers. \nIf using the Instant pot, pressure cook the lentils on high pressure for 30 minutes with natural pressure release.\nMash some of the dal and rajma using a potato masher. Then turn on the heat to lowest heat and let the dal simmer while you make the masala.\nTo make the masala, in a large pot/pan, heat 2 tablespoons butter  (I use and recommend amul salted butter here) and 1 tablespoon ghee on medium heat.\nOnce the butter melts and is hot, add the finely grated onion. Cook the onion for around 6 to 7 minutes or until it turns light golden brown. Keep stirring it continuously so that it doesn't burn and keep heat on medium.\nAdd the ginger garlic paste and cook for 1 to 2 minute until the raw smell goes away.\nAdd the tomato puree and mix. Cook for 2 minutes or until the puree mixes well with masala and oil starts oozing out from the sides.\nAdd in the boiled dal (which had been simmering for around 10 to 15 mins you were making the masala) and mix. \nAdd garam masala, kashmiri red chili powder and salt. Mix to combine. \nAdd 1/2 cup water, stir and set heat to low. Let it simmer on low heat uncovered for around 45 minutes. \nStir often (every 10 minutes or so) else dal will stick to the bottom of the pot. You will also need to add water. I added total of 1.5 cups water as the dal was simmering.\nAdd sugar and mix after the dal has simmered for 45 minutes.\nAlso add the remaining 1 tablespoon butter and 1/4 cup cream. Mix well.\nSimmer for 10 more minutes on low heat after adding the cream. Dal will become really creamy by now. You may serve the dal at this point or do the additional step of giving it a smokey flavor.\nThis last step (dhungar method) is optional but recommend. For the smokey flavor, place a steel bowl on top of a trivet placed inside the dal. Then heat a piece of charcoal over direct heat until its red hot.\nPlace hot charcoal in that steel bowl on top of the trivet. Pour melted ghee (around 1 tablespoon) on top of charcoal.\nYou will immediately see fumes coming out of charcoal. Immediately close the pan with a lid. Let it remain like this for 2 minutes. After 2 minutes, remove lid and remove the bowl from dal. The longer you keep the lid closed, the smokier dal will get and for dal makhani I don't like it very smokey so 2 minutes was good for me. You may do 5 minutes but don't do more.\nGarnish dal makhani with more cream and serve with a pat of amul butter. Enjoy",
          "recipeDuration" : "2 Hours",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FDal%20Makhni%2FImageimage%3A134151?alt=media&token=1546890b-8ce2-4d0e-a923-a75496db0246",
          "recipeIngredients" : "To Pressure Cook\n▢3/4 cup urad dal sabut (whole black lentil) 165 grams\n▢1/4 cup rajma (red kidney beans) 60 grams\n▢1 teaspoon salt\n▢3.5 cups water 28 oz\nMasala for the Dal\n▢1 tablespoon ghee\n▢3 tablespoons butter divided, use amul butter (salted) if possible\n▢1 medium white onion 115 grams, finely grated using a food processor\n▢2 teaspoons ginger garlic paste use fresh paste if possible\n▢1/2 cup tomato puree use store bought tomato puree\n▢1/2 teaspoon kashmiri red chili powder\n▢1/4 teaspoon garam masala\n▢1/2 teaspoon salt or to taste\n▢1.5 cups water 12 oz, as needed\n▢1/2 teaspoon sugar\n▢1/4 cup cream 60 ml\n▢more amul butter (salted) for serving\n▢piece of charcoal optional, for giving dal a smokey flavor",
          "recipeName" : "Dal Makhni",
          "recipeType" : "Lunch"
        }
      },
      "Meggie" : {
        "-MiJCv9tA9InWNTl94xv" : {
          "chefName" : "Raheem",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large kadai heat oil and saute garlic.\n\nfurther add onion, and saute till they change colour.\n\nalso add capsicum and saute for a minute.\n\nadditionally add tomato and saute till they turn soft and mushy.\n\nfurthermore, add ¼ cup of brocolli and ¼ cup of peas. saute for 2 minutes.\n\nalso add ½ tsp turmeric powder, ½ tsp red chilli powder and ¼ tsp garam masala powder. saute for a minute on low flame.\n\nadd 2 cups of water and get to boil.\n\nonce the water begins to boil, add 2 sachets maggi masala and salt.\n\nstir well and get the water to boil.\n\nadd in 2 maggi noodles breaking into 2 half.\n\nspread and cook both the sides.\n\nboil for 2 minutes and stir occasionally.\n\ncook till the noodels absorb water and gets cooked completely.\n\nsprinkle chaat masala for more flavours just before serving.\n\nfinally, maggi masala recipe is ready to be served hot.",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134155?alt=media&token=eda4e2d1-5f72-48db-a002-e558a29654a1",
          "recipeIngredients" : "1 pack Maggi Noodles or Instant Ramen Noodles\n1 teaspoon Oil\n2 Garlic Cloves finely chopped\n1 cup Mushrooms diced\n1/2 cup Red Pasta Sauce\n1/4 teaspoon Oregano dried\n2 tablespoons Olives sliced\nA few Basil leaves\n2 tablespoon Parmesan grated\nSalt to taste",
          "recipeName" : "Meggie",
          "recipeType" : "Snacks"
        }
      }
    },
    "w5Qu04DZnsOtXzYeTGVk3b3gozj2" : {
      "Honey Garlic Glazed Salmon" : {
        "-MiKevBGOFbTMSSM7k0J" : {
          "chefName" : "Gordan Ramsey",
          "countryName" : "Turkey",
          "recipeDirections" : "In a medium bowl, whisk together honey, soy sauce, lemon juice and red pepper flakes.\nIn a large skillet over medium-high heat, heat two tablespoons oil. When oil is hot but not smoking, add salmon skin-side up and season with salt and pepper. Cook salmon until deeply golden, about 6 minutes, then flip over and add remaining tablespoon of oil.\nAdd garlic to the skillet and cook until fragrant, 1 minute. Add the honey mixture and sliced lemons and cook until sauce is reduced by about 1/3. Baste salmon with the sauce.\nGarnish with sliced lemon and serve.",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FHoney%20Garlic%20Glazed%20Salmon%2FImageimage%3A134152?alt=media&token=331a108a-d28a-43a5-9c68-6544d413e0d0",
          "recipeIngredients" : "1/3 c. honey\n1/4 c. soy sauce\n2 tbsp. lemon juice\n1 tsp. red pepper flakes\n3 tbsp. extra-virgin olive oil, divided\n4 6-oz. salmon fillets, patted dry with a paper towel\nKosher salt\nFreshly ground black pepper\n3 cloves garlic, minced\n1 lemon, sliced into rounds",
          "recipeName" : "Honey Garlic Glazed Salmon",
          "recipeType" : "Dinner"
        }
      },
      "Meggie" : {
        "-MiKWJXj4-UwhdEhB1xz" : {
          "chefName" : "Raheem",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large kadai heat oil and saute garlic.\n\nfurther add onion, and saute till they change colour.\n\nalso add capsicum and saute for a minute.\n\nadditionally add tomato and saute till they turn soft and mushy.\n\nfurthermore, add ¼ cup of brocolli and ¼ cup of peas. saute for 2 minutes.\n\nalso add ½ tsp turmeric powder, ½ tsp red chilli powder and ¼ tsp garam masala powder. saute for a minute on low flame.\n\nadd 2 cups of water and get to boil.\n\nonce the water begins to boil, add 2 sachets maggi masala and salt.\n\nstir well and get the water to boil.\n\nadd in 2 maggi noodles breaking into 2 half.\n\nspread and cook both the sides.\n\nboil for 2 minutes and stir occasionally.\n\ncook till the noodels absorb water and gets cooked completely.\n\nsprinkle chaat masala for more flavours just before serving.\n\nfinally, maggi masala recipe is ready to be served hot.",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134155?alt=media&token=eda4e2d1-5f72-48db-a002-e558a29654a1",
          "recipeIngredients" : "1 pack Maggi Noodles or Instant Ramen Noodles\n1 teaspoon Oil\n2 Garlic Cloves finely chopped\n1 cup Mushrooms diced\n1/2 cup Red Pasta Sauce\n1/4 teaspoon Oregano dried\n2 tablespoons Olives sliced\nA few Basil leaves\n2 tablespoon Parmesan grated\nSalt to taste",
          "recipeName" : "Meggie",
          "recipeType" : "Snacks"
        }
      },
      "Oven baked omelet" : {
        "-MiKc-bLnv5a6fh9qJRY" : {
          "chefName" : "Omel Banin",
          "countryName" : "Argentina",
          "recipeDirections" : "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish with butter.\n\nBeat eggs, sour cream, milk, and salt in a bowl until blended. Stir in green onions. Pour mixture in the prepared baking dish.\n\nBake in the preheated oven until set, 25 to 30 minutes. Sprinkle Cheddar cheese over eggs and continue baking until cheese is melted, 2 to 3 minutes more.",
          "recipeDuration" : "40 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FOven%20baked%20omelet%2FImageimage%3A39759?alt=media&token=67eed627-b730-4f3f-bcdb-4a1c6e0fd9f1",
          "recipeIngredients" : "1 teaspoon butter\n\n9 large eggs\n\n½ cup sour cream\n\n½ cup milk\n\n1 teaspoon salt\n\n2 green onions, chopped\n\n¼ cup shredded Cheddar cheese",
          "recipeName" : "Oven baked omelet",
          "recipeType" : "Breakfast"
        }
      }
    }
  },
  "User Favourite Recipes" : {
    "vwkNUIMU73QU2BIaltsXMcrSt0A2" : {
      "Meggie" : {
        "-MiJCvKZOziAOxjl5Rwr" : {
          "chefName" : "Raheem",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large kadai heat oil and saute garlic.\n\nfurther add onion, and saute till they change colour.\n\nalso add capsicum and saute for a minute.\n\nadditionally add tomato and saute till they turn soft and mushy.\n\nfurthermore, add ¼ cup of brocolli and ¼ cup of peas. saute for 2 minutes.\n\nalso add ½ tsp turmeric powder, ½ tsp red chilli powder and ¼ tsp garam masala powder. saute for a minute on low flame.\n\nadd 2 cups of water and get to boil.\n\nonce the water begins to boil, add 2 sachets maggi masala and salt.\n\nstir well and get the water to boil.\n\nadd in 2 maggi noodles breaking into 2 half.\n\nspread and cook both the sides.\n\nboil for 2 minutes and stir occasionally.\n\ncook till the noodels absorb water and gets cooked completely.\n\nsprinkle chaat masala for more flavours just before serving.\n\nfinally, maggi masala recipe is ready to be served hot.",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134155?alt=media&token=eda4e2d1-5f72-48db-a002-e558a29654a1",
          "recipeIngredients" : "1 pack Maggi Noodles or Instant Ramen Noodles\n1 teaspoon Oil\n2 Garlic Cloves finely chopped\n1 cup Mushrooms diced\n1/2 cup Red Pasta Sauce\n1/4 teaspoon Oregano dried\n2 tablespoons Olives sliced\nA few Basil leaves\n2 tablespoon Parmesan grated\nSalt to taste",
          "recipeName" : "Meggie",
          "recipeType" : "Snacks"
        }
      }
    }
  },
  "User Profile Details" : {
    "IUKcsosLqFhWyuOtagcogza25QJ2" : {
      "-MiIRpOeNMFSQWt1YWSe" : {
        "email" : "thakkarmanali2015@gmail.com",
        "name" : "Manali"
      }
    },
    "JaPyUxgjzGRcuwZbQtDWfBL2LkJ3" : {
      "-Mhys_-uxxM-gf0R4xtQ" : {
        "email" : "tejadon083@gmail.com",
        "name" : "Tejas"
      }
    },
    "JuWdaR5kewMTa2oaSO0p4GOStVu1" : {
      "-MhsxuJYivREIIlEgfB5" : {
        "email" : "harishalle8@gmail.com",
        "name" : "harish"
      }
    },
    "NuxPL1bcAuUWmjpuEoVGC4vjjKS2" : {
      "-MiK_o8L0mC8ZN8RRl44" : {
        "email" : "manhil2908@gmail.com",
        "name" : "manhil"
      }
    },
    "vwkNUIMU73QU2BIaltsXMcrSt0A2" : {
      "-MhstCfy1JNKMVU9F1zr" : {
        "email" : "sahil33rana@gmail.com",
        "name" : "sahil"
      }
    },
    "w5Qu04DZnsOtXzYeTGVk3b3gozj2" : {
      "-MhV91DQeqNc_i0VaXzW" : {
        "email" : "tjp083@gmail.com",
        "name" : "Tejas Patel"
      }
    }
  },
  "User Recipe Details" : {
    "IUKcsosLqFhWyuOtagcogza25QJ2" : {
      "Aloo puri" : {
        "-MiJ7_z0syOVrJveZDgT" : {
          "chefName" : "Rita ben",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large bowl take 2 cup of wheat flour and 2 tbsp rava.\n\nalso add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala, ¼ tsp ajwain, 1 tsp kasuri methi and ½ tsp salt.\n\nmix well making sure all the spices are well combined.\n\nfurther, add mashed 3 potatoes and mix well.\n\nadd water and start to knead the dough.\n\nmake sure to knead the dough adding water as required. also note that aloo will release the moisture, so add water accordingly.\n\nknead to a smooth and tight dough.\n\nalso, add 2 tbsp oil and knead the dough.\n\nnow take a ball and roll using a rolling pin.\n\nroll to slightly thick thickness.\n\ndrop the rolled dough into the hot oil.\n\npress until the puri puffs up and splash oil to puff up fully.\n\nflip over and fry until it turns golden brown.\n\nfinally, drain off the aloo poori and is ready to enjoy with sabzi or pickle.",
          "recipeDuration" : "40 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FAloo%20puri%2FImageimage%3A151109?alt=media&token=b5015fec-140b-4e7c-ae62-acbef28c1010",
          "recipeIngredients" : "3 aloo / potato boiled\n\n2 cup wheat flour / atta\n\n2 tbsp rava / semolina fine\n\n¼ tsp turmeric\n\n½ tsp chilli powder\n\n½ tsp cumin powder\n\n½ tsp garam masala\n\n¼ tsp ajwain / carom seeds\n\n1 tsp kasuri methi crushed\n\n½ tsp salt\n\nwater for kneading\n\noil for frying",
          "recipeName" : "Aloo puri",
          "recipeType" : "Dinner"
        }
      },
      "Coconut pudding" : {
        "-MiJ8ghoZu6FlemOkGki" : {
          "chefName" : "Sahil",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a mixi take 2 cup coconut, 3 pods cardamom.\n\nadd 500 ml warm water and blend well.\n\nstrain the coconut milk using the muslin cloth. use first extract coconut milk or you can use 500 ml coconut milk from the tin.\n\nnow take coconut milk into a large bowl. add 5 tbsp cornflour, ½ cup sugar and pinch salt.\n\nwhisk and mix well making sure there are no lumps. in place of cornflour you can also use custard powder.\n\ntransfer the mixture to a large kadai keeping the flame on low.\n\nkeep stirring the mixture until it thickens.\n\nthe mixture starts to thicken and turns glossy, that is the right consistency. over cooking will make hard pudding. undercooking will make it sticky and difficult to set.\n\npour the mixture into the moulds greased with oil.\n\ncool completely and refrigerate for 2 hours to set completely.\n\nfinally, enjoy coconut pudding topped with mango puree.",
          "recipeDuration" : "30 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCoconut%20pudding%2FImageimage%3A151111?alt=media&token=2ff06e7c-b038-4a8a-bf01-d806c7b540e6",
          "recipeIngredients" : "2 cup coconut grated\n\n3 pods cardamom\n\n500 ml warm water\n\n5 tbsp cornflour\n\n½ cup sugar\n\npinch salt",
          "recipeName" : "Coconut pudding",
          "recipeType" : "Desserts"
        }
      },
      "Grilled sandwich" : {
        "-MiJ86IHf2lkjmuFNTXC" : {
          "chefName" : "Gauri Gupta",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large mixing bowl mash boiled potatoes.\n\nalso add in chopped onions.\n\nfurthermore, add crumbled paneer.\n\nalso add chilli powder, chaat masala, mixed herbs and salt.\n\nmix and mash the potatoes well.\n\nfurther take bread slices and spread green chutney and tomato sauce.\n\nspread the generous amount of prepared potato stuffing.\n\ncover with the other bread slice and press gently.\n\nthen grill or toast on tawa adding some butter.\n\nspread butter on both the outer sides of bread to make sandwich more crispy and golden.\n\nfurthermore, close the griller and grill till the cheese melts and bread turn golden brown.\n\nnow cut the bread into half and serve.\n\nfinally, serve hot or pack for kids lunch box.",
          "recipeDuration" : "20 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FGrilled%20sandwich%2FImageimage%3A151110?alt=media&token=459cf919-80fd-4232-b3be-9540036ef014",
          "recipeIngredients" : "2 small sized potato boiled and pealed\n\n½ onion finely chopped\n\n½ cup paneer / cottage cheese crumbled\n\nsalt to taste\n\n½ tsp kashmiri chilli powder\n\n¼ tsp chaat masala\n\nbutter to grill\n\n¼ tsp mixed herbs thyme, rosemary, marjoram, basil, oregano, sage\n\n4 bread slices\n\n2 tsp green chutney\n\n2 tsp tomato sauce",
          "recipeName" : "Grilled sandwich",
          "recipeType" : "Snacks"
        }
      },
      "Milk powder burfi" : {
        "-MiKZMPMaOSKOvZhULmY" : {
          "chefName" : "Allu arjun",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large kadai add in ¼ cup ghee and ¾ cup milk.\n\nkeeping the flame on low add in 2½ cup milk powder.\n\nalso add ½ cup sugar. add more sugar if required.\n\nmix well making sure everything is combined well.\n\nstir continuously keeping the flame on low and no lumps formed.\n\nalso stir till the sugar dissolves.\n\nnow keep stirring keeping the flame on low till milk thickens.\n\nfurthermore, the milk forms dough after stirring for 10 minutes.\n\nnow the dough separates from the pan.\n\ndo not over cook, as the burfi turns chewy.\n\nadd in ¼ tsp cardamom powder and combine well.\n\ntransfer the prepared dough into greased plate lined with baking paper.\n\nset well forming a block.\n\nnow top with few chopped almonds and pistachios and press slightly.\n\nallow to set for 2 hours, or till it sets completely.\n\nnow unmould and cut into pieces.\n\nfinally, serve milk powder burfi or store in airtight container.",
          "recipeDuration" : "55 mins",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMilk%20powder%20burfi%2FImageimage%3A151129?alt=media&token=8f757b5d-39a0-487e-9771-5ebe7bbfce3f",
          "recipeIngredients" : "¼ cup ghee / clarified butter\n\n¾ cup milk\n\n2½ cup milk powder\n\n½ cup sugar\n\n¼ tsp cardamom powder / elachi powder\n\n2 tbsp almonds chopped\n\n2 tbsp pistachios chopped",
          "recipeName" : "Milk powder burfi",
          "recipeType" : "Desserts"
        }
      },
      "Rava laddu" : {
        "-MiKYfsFFD46WSvAq1eK" : {
          "chefName" : "gurubai mehat",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a pan heat ¼ cup ghee and add 1½ cup rava.\n\nroast on low flame until the rava turns aromatic.\n\nkeep roasting on low flame. make sure not to roast on high flame as it changes the color of rava.\n\nnow add ½ cup coconut and roast for 2 minutes. keep aside.\n\nin a large kadai take 1½ cup sugar and ½ cup water.\n\nstir and boil the sugar until 1 string sugar syrup consistency is reached.\n\nturn off the flame and add roasted rava. make sure to turn off the flame, else the ladoo will turn hard.\n\nkeep stirring until the rava is well combined with sugar syrup. keep aside for 2 minutes.\n\nmeanwhile, in a pan heat 1 tsp ghee. roast 2 tbsp cashew and 2 tbsp raisins until it turns golden brown.\n\nadd fried cashew, raisins, and ¼ tsp cardamom powder.\n\nmix well until the mixture turns moist absorbing the sugar syrup.\n\ninitially, the mixture will be moist and later it starts to absorb and turns to crumble texture but moist.\n\nstart preparing the ladoo immediately, the ladoo will harden once cooled. once cooled, if the mixture turns dry, you can warm it in the microwave.\n\nfinally, enjoy rava laddu for a week when stored in an airtight container.",
          "recipeDuration" : "1 hour",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FRava%20laddu%2FImageimage%3A151128?alt=media&token=25434270-a5b2-4370-a1bb-6d3f0c3aa8da",
          "recipeIngredients" : "for suji ladoo:\n\n¼ cup ghee\n\n1½ cup rava / semolina / suji coarse\n\n½ cup coconut grated\n\n1½ cup sugar\n\n½ cup water\n\n¼ tsp cardamom powder\n\nfor roasting nuts:\n\n1 tsp ghee\n\n2 tbsp cashew halves\n\n2 tbsp raisins",
          "recipeName" : "Rava laddu",
          "recipeType" : "Desserts"
        }
      },
      "Sahi Paratha" : {
        "-MiJ6Nqp3HyMY-Tn2VWP" : {
          "chefName" : "Kunak khanna",
          "countryName" : "India",
          "recipeDirections" : "how to knead dough for paratha:\n\nfirstly, in a large bowl take 3 cup of wheat flour, ¼ tsp ajwain and ½ tsp salt.\n\nmix well combining all the ingredients well.\n\nnow add warm milk and start to knead the dough. kneading the dough with milk helps to make soft paratha and is also flavourful.\n\nadd milk as required and knead to a smooth and soft dough.\n\ngrease the dough with oil, cover and rest for 20 minutes.\n\nhow to make aloo stuffing for paratha:\n\nin a large bowl take 3 potato, ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp cumin powder, ½ tsp garam masala, 1 tsp aamchur, ¼ tsp ajwain and ½ tsp salt.\n\nalso add 3 chilli, ½ tsp ginger paste and 2 tbsp coriander.\n\nmix well making sure everything is well combined. keep aside.\n\nhow to prepare the paratha:\n\nafter the dough has rested for 20 minutes, knead slightly and pinch a ball sized dough.\n\ndust the dough with wheat flour and roll slightly.\n\nplace a ball sized aloo masala in the centre and then top with 2 tbsp chopped cashew and raisins.\n\nalso top with 3 tbsp paneer  and pinch of garam masala.\n\ntake the edge and start pleating bringing it to the centre.\n\nalso join the pleats together and secure tight pinching off excess dough.\n\nsprinkle some wheat flour and roll slightly thick.\n\non a hot tawa place the rolled paratha and cook for a minute.\n\nfurthermore, flip the paratha when the base is partly cooked (after a minute).\n\nalso, brush oil / ghee and press slightly. flip again once or twice till both the sides are cooked properly.\n\nfinally, serve hot shahi paratha with butter, raita or pickle.",
          "recipeDuration" : "30 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSahi%20Paratha%2FImageimage%3A151106?alt=media&token=e65961e0-8655-4cd0-b6c3-766c051a004f",
          "recipeIngredients" : "for dough:\n\n3 cup wheat flour\n\n¼ tsp ajwain / carom seeds\n\n½ tsp salt\n\nmilk for kneading\n\n2 tsp oil for greasing\n\nfor stuffing:\n\n3 potato / aloo boiled & grated\n\n¼ tsp turmeric\n\n½ tsp chilli powder\n\n½ tsp cumin powder\n\n½ tsp garam masala\n\n1 tsp aamchur\n\n¼ tsp ajwain / carom seeds\n\n½ tsp salt\n\n3 chilli finely chopped\n\n½ tsp ginger paste\n\n2 tbsp coriander finely chopped",
          "recipeName" : "Sahi Paratha",
          "recipeType" : "Brunch"
        }
      },
      "classic caesar" : {
        "-MiJ9oXuSA9_GCWPZIIm" : {
          "chefName" : "Tejas Don",
          "countryName" : "Canada",
          "recipeDirections" : "Wet the rim of a cocktail glass with the lime wedge; set aside for garnish. Place celery salt in a small dish, and press the rim of the glass into the salt to coat. Add ice to the glass.\n\n\nPour vodka, Worcestershire sauce, and hot pepper sauce over the ice; top with tomato-clam juice. Garnish with lime wedge and celery stick. Serve with a straw.",
          "recipeDuration" : "5 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fclassic%20caesar%2FImageimage%3A151112?alt=media&token=4579fd58-85ec-4d5a-930c-f0b8b15c1fa4",
          "recipeIngredients" : "1 lime wedge\n\n1 tablespoon celery salt, or as needed\n\nice cubes, as needed\n\n1 fluid ounce vodka\n\n1 dash Worcestershire sauce, or to taste\n\n1 dash hot pepper sauce (such as Tabasco®), or to taste\n\n8 fluid ounces tomato and clam juice cocktail (such as Clamato®)\n\n1 celery stick",
          "recipeName" : "classic caesar",
          "recipeType" : "Drinks"
        }
      },
      "idli" : {
        "-MiJ5iNh7qM-bBJK3PC4" : {
          "chefName" : "Anna Khan",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large bowl take 1 cup urad dal and rinse well.\n\nsoak in water for 4 hours.\n\nafter soaking for 4 hours, transfer the dal to mixi jar. you can alternatively grind in a grinder.\n\ngrind to smooth and fluffy batter adding water as required.\n\ntransfer the batter to a large bowl.\n\nnow in another bowl take 2 cups rice rava and rinse a couple of times.\n\nsqueeze off the water from the rava and transfer it to the urad dal batter bowl.\n\nmix well using your hand. this helps to aid fermentation.\n\nnow cover and keep in a warm place for 8 hours for fermentation.\n\nafter 8 hours, the batter has well fermented. mix gently.\n\nadd 1 tsp salt and mix making sure the salt is well combined.\n\nnow to prepare the cups from banana leaf, cut the banana leaf into a round shape.\n\nand using a stapler, pin it up into 4 sides forming a cup.\n\nplace the cup in the steamer and pour the batter into the molds.\n\ncover and steam for 20 minutes or until the idlis are cooked well.\n\nfinally, enjoy soft idli with chutney or sambar.",
          "recipeDuration" : "20 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151099?alt=media&token=c770198a-b7c1-4ef3-ae85-52383f1fabae",
          "recipeIngredients" : "1 cup urad dal\n2 cup rice rava / idli rava\n1 tsp salt\nbanana leaves to make cups",
          "recipeName" : "idli",
          "recipeType" : "Breakfast"
        }
      },
      "panneer butter masala" : {
        "-MiJ6ys39QENWojOdZjW" : {
          "chefName" : "Ranveer brar",
          "countryName" : "India",
          "recipeDirections" : "how to make gravy base:\n\nfirstly, in a large kadai heat 2 tbsp oil and 2 tbsp butter.\n\nadd 5 cloves, 2 pods cardamom and saute on low flame until it turns aromatic.\n\nnow add 2 onion, 2 clove garlic, 1 inch ginger.\n\nsaute until onions shrink slightly.\n\nfurther add 3 tomato, 15 cashew and saute for 2 minutes.\n\ncover and boil for 10 minutes, or until tomato softens.\n\ncool completely and transfer to the blender and blend to smooth paste.\n\npass the curry to the filter to get rid of seeds and skin.\n\nsmooth and silky, the tomato-onion paste is ready. keep aside.\n\nhow to make paneer butter masala:\n\nfirstly, in a large kadai heat 2 tbsp oil, 2 tbsp butter, 1 bay leaf and 1 chilli. saute until the spices turn aromatic.\n\nnow add 1 onion and saute until onions turn and golden brown.\n\nkeeping the flame on low, add ½ tsp turmeric, 1 tsp chilli powder, ¾ tsp coriander powder, ¼ tsp cumin powder, ½ garam masala and 1 tsp salt.\n\nsaute until the spices turn aromatic. make sure not to burn the spices.\n\nadd in prepared onion tomato paste and mix well.\n\ncook until the oil separates from the masala paste.\n\nnow add 1 cup water and mix well adjusting the consistency.\n\nfurther, add in 2 tbsp cream and mix well.\n\nalso, add 16 cubes of paneer and mix gently.\n\nsimmer for 5 minutes, or until the paneer absorbs the flavour.\n\nadd 1 tsp kasuri methi and 2 tbsp coriander. mix well.\n\nfinally, enjoy paneer butter masala with roti or naan.",
          "recipeDuration" : "50 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fpanneer%20butter%20masala%2FImageimage%3A151108?alt=media&token=c8ee5e80-1043-4e1b-aecb-f8f769c249da",
          "recipeIngredients" : "for masala paste:\n\n2 tbsp oil\n\n2 tbsp butter\n\n5 cloves\n\n2 pods cardamom\n\n2 onion sliced\n\n2 clove garlic\n\n1 inch ginger\n\n3 tomato sliced\n\n15 cashew\n\nfor curry:\n\n2 tbsp oil\n\n2 tbsp butter\n\n1 bay leaf\n\n1 chilli\n\n1 onion finely chopped\n\n½ tsp turmeric\n\n1 tsp chilli powder\n\n¾ tsp coriander powder\n\n¼ tsp cumin powder\n\n½ garam masala\n\n1 tsp salt\n\n1 cup water\n\n2 tbsp cream\n\n16 cubes paneer\n\n1 tsp kasuri methi\n\n2 tbsp coriander finely chopped",
          "recipeName" : "panneer butter masala",
          "recipeType" : "Lunch"
        }
      },
      "peanut butter cookies" : {
        "-MiJBYQqdVM0VHO4rqnQ" : {
          "chefName" : "Guru Govind lala",
          "countryName" : "India",
          "recipeDirections" : "First, make your flax egg. Combine the flax and water and set it aside for 5 minutes to thicken.\nThen, whisk together the wet ingredients and the dry ingredients in separate bowls. Fold the dry ingredients into the wet ingredients and stir until everything is well combined. The dough will be very thick!Next, it’s time to chill. Pop the cookie dough in the fridge for 30 minutes, and preheat the oven to 350.\nWhen the dough is chilled, you can bake! Use a 2-tablespoon cookie scoop to portion out the dough and roll it into balls. Press the dough balls down gently with your hands before using a fork to give them the signature peanut butter cookie criss cross pattern. Bake the cookies on a parchment-lined baking sheet for 12 minutes. They will still be fragile at this point, so allow them to rest for 10 minutes on the baking sheet before transferring them to a wire rack to cool completely.",
          "recipeDuration" : "10 min",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fpeanut%20butter%20cookies%2FImageimage%3A151114?alt=media&token=419c59e1-8d2c-4a45-a3d6-fc763fff757b",
          "recipeIngredients" : "Ground flaxseed \nBrown sugar and cane sugar \nCoconut oil   \nVanilla extract\nAnd sea salt",
          "recipeName" : "peanut butter cookies",
          "recipeType" : "Baking"
        }
      }
    },
    "JuWdaR5kewMTa2oaSO0p4GOStVu1" : {
      "Badami Milk" : {
        "-MiK7IgEtxwChbUfmSNt" : {
          "chefName" : "Jagjith",
          "countryName" : "India",
          "recipeDirections" : "Soak almond in hot water for 20 minutes. After 20 minutes, discard the water and then remove the skin from each almond. It will come off easily.\nTransfer blanched almonds with ¼ cup milk to a blender. Blend to a smooth paste. Set it aside.\nNow transfer the remaining milk to a pan and put in on medium-high heat.\nAs the milk warms up, take out 1 tablespoon of the warm milk from the pan into a small bowl and add crushed saffron strands to it. Set aside.\nOnce the milk in the pan comes to a boil, add the prepared almond paste to it. Stir to combine.\nLower the heat to low medium and let the milk simmer for 15 to 20 minutes. Stir often so that milk doesn’t get stuck to the bottom of the pan. The raw smell of almonds should disappear completely.\nAdd in the saffron milk that you had set aside.\nThen add the sugar and stir until it’s dissolved.\nFinally add in the crushed cardamom seeds. You may also add rose water (if using) at this point. Mix everything together and turn off the heat.\nServe badam milk hot or cold. I personally love it chilled.",
          "recipeDuration" : "35 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBadami%20Milk%2FImageimage%3A91?alt=media&token=c7819763-f21a-4e3b-93e9-9b18afc7903f",
          "recipeIngredients" : "Serves 4 People\n35 almonds 40 grams\n1 liter whole milk\ngenerous pinch saffron dissolved in 1 tablespoon milk\n4-6 tablespoons granulated white sugar 50-75 grams, or to taste\n5-6 green cardamom pods seeds removed & crushed using a mortar and pestle\n1/2 teaspoon rose water optional",
          "recipeName" : "Badami Milk",
          "recipeType" : "Drinks"
        }
      },
      "Carrot Cake Cookies" : {
        "-MiJr6gvdqxcvISz9u68" : {
          "chefName" : "Kranthi",
          "countryName" : "India",
          "recipeDirections" : "Preheat the oven to 350°F and line two large baking sheets with parchment paper.\nIn a small bowl, combine the flaxseed and warm water and set aside to thicken for 5 minutes.\nIn a large bowl, stir together the oat flour, the additional 1 cup rolled oats, almond flour, baking powder, baking soda, cinnamon, nutmeg and salt.\nIn a medium bowl, combine the carrots, almond butter, coconut oil, and maple syrup, and vanilla and stir well. Add the flaxseed mixture and stir well to incorporate.\nAdd the wet ingredients to the bowl of dry ingredients and fold in just until combined. Fold in the walnuts.\nScoop ¼ cup of batter for each cookie onto the baking sheets. Bake, one sheet at a time, for 20 to 24 minutes, or until browned around the edges. Cool on the pan for 5 minutes and then transfer to a wire rack to finish cooling.\nWhen cookies are completely cool, pipe with cream cheese frosting, if desired.",
          "recipeDuration" : "35 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCarrot%20Cake%20Cookies%2FImageimage%3A71?alt=media&token=cc432d90-4298-4765-b251-a89eeda25368",
          "recipeIngredients" : "2 tablespoons ground flaxseed\n5 tablespoons warm water\n1 cup oat flour\n1 cup additional whole rolled oats\n½ cup almond flour\n½ teaspoon baking powder\n½ teaspoon baking soda\n1 teaspoon cinnamon\n½ teaspoon nutmeg\n½ teaspoon sea salt\n1 cup grated carrots, (about 3 medium)\n½ cup almond butter\n¼ cup coconut oil, melted\n½ cup maple syrup\n1 teaspoon vanilla extract\n⅓ cup chopped walnuts or pecans\n1/2 recipe Vegan Cream Cheese Frosting, optional",
          "recipeName" : "Carrot Cake Cookies",
          "recipeType" : "Brunch"
        }
      },
      "Cinnamon Rolls" : {
        "-MiJpvVxWpyxdUwNUbdo" : {
          "chefName" : "Harish",
          "countryName" : "Italy",
          "recipeDirections" : "Grease an 8x11 or 9x13-inch baking dish.\nIn a small bowl, stir together the water, yeast, and sugar. Set aside for 5 minutes, or until the yeast is foamy.\nMake the dough: In a medium bowl, combine the coconut oil, almond milk, sugar, and salt. Stir in the yeast mixture. Place the flour in a large bowl, then add the yeast mixture and stir until combined. The mixture will be sticky. Use your hands to roughly knead the mixture, then turn it out onto a floured surface. Knead 3 to 4 minutes until smooth, sprinkle with more flour if needed, and form into a ball.\nBrush a large bowl with coconut oil and place the dough inside. Cover with plastic wrap and set aside in a warm place to rise until doubled in size, about 1 hour.\nMake the filling: In a small bowl, mix the brown sugar and cinnamon.\nPunch down dough and roll out on a floured surface into a 20x14-inch rectangle. Brush with 2 tablespoons melted coconut oil and sprinkle with the cinnamon sugar to within ½ inch of the edges.\nStarting at one of the short 14-inch ends, roll tightly into a log, then slice into 12 rolls. Place the rolls into the baking dish cut-side up, cover, and let rise for 1 hour.\nPreheat the oven to 350°F.\nMake the glaze: In a medium bowl, whisk together the powdered sugar, 3 tablespoons almond milk, and vanilla until smooth. If it’s too thick, add more almond milk.\nBake the rolls 25 to 30 minutes or until lightly golden on top. Remove and allow to cool for 10 minutes, then drizzle the glaze on top and serve.",
          "recipeDuration" : "30 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCinnamon%20Rolls%2FImageimage%3A69?alt=media&token=cae82233-c425-4630-9ae1-4024bef25c41",
          "recipeIngredients" : "Serves 12 people\nFor the yeast\n½ cup warm water, 110°\n1 (¼-ounce) package active dry yeast\n1 teaspoon cane sugar\nDough\n⅓ cup melted coconut oil, plus more for brushing\n½ cup Almond Breeze Almondmilk, at room temperature\n⅓ cup cane sugar\n1 teaspoon sea salt\n2¾ cups all-purpose flour, plus more for kneading\nFilling\n½ cup brown sugar\n1½ tablespoons cinnamon\nGlaze\n1½ cups powdered sugar, sifted\n3 to 4 tablespoons Almond Breeze Almondmilk\n½ teaspoon vanilla extract",
          "recipeName" : "Cinnamon Rolls",
          "recipeType" : "Brunch"
        }
      },
      "Kadai Chole" : {
        "-MiK-0_JAWIMW8erZjdg" : {
          "chefName" : "Nikesh",
          "countryName" : "India",
          "recipeDirections" : "Soak 1 cup of raw chickpeas in water for 6 hours or preferably overnight or use 2.5 cups of canned chickpeas.\nPressure cook the chickpeas with bay leaf, cardamom pods, tea bags, black cardamom, cloves and salt. Cook at high flame for 1 whistle and then lower the flame to medium and cook for another 5 minutes. Once the chickpeas are done, drain the water and set them aside. [Skip this step if using canned chickpeas]\nHeat ghee or oil in a pan on medium heat.\nOnce hot add the ginger juliennes and sliced green chilli.\nOnce the ginger turns light golden brown add in all the spices and cook for 2 minutes.\nAdd little water [around 1-2 tablespoons] so that the spices do not get burnt.\nAdd the chickpeas and mix thoroughly.\nNow add salt and also little water, around 2 tablespoons and cook for 3-4 minutes or till most of the water is absorbed.\nAdd the cubed tomatoes and mix.\nCook till tomatoes are little cooked, say around 2-3 minutes. You don't want to them to be mushy.\nSwitch off the flame and garnish with coriander leaves (optional). Serve hot chole with bhature or kulche.",
          "recipeDuration" : "60 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKadai%20Chole%2FImageimage%3A83?alt=media&token=13a131f4-8184-4000-9b55-5324964a84ce",
          "recipeIngredients" : "Serves 3 people\n1 cup chickpeas raw\n1 bay leaf\n2 green cardamom pods\n2 cloves\n1 black cardamom\n1 inch ginger cut into juliennes\n2 green chilies slit lengthwise\n1 tablespoon chole masala\n1 teaspoon coriander powder\n¼ teaspoon garam masala\n¼ teaspoon mango powder amchur\n½ teaspoon cumin powder\n1 to mato cut into cubes\n1 teaspoon ghee clarified butter\n1 teaspoon oil\n2 tea bags\nsalt to taste\n2-3 tablespoons of water",
          "recipeName" : "Kadai Chole",
          "recipeType" : "Lunch"
        }
      },
      "Kaju Masala" : {
        "-MiJy7MAwyuY3px_Bldu" : {
          "chefName" : "Kranthi",
          "countryName" : "India",
          "recipeDirections" : "To a pan on medium heat, add 2 teaspoons ghee. Then add 1 cup whole cashews and sauté, stirring often until the cashews turn light golden brown in color, around 2 to 3 minutes. Remove cashews from pan on a plate and set aside.\nTo the same pan, now add 1 tablespoon ghee and 1 tablespoon oil. Once hot, add the whole spices- 1-inch cinnamon stick, 1 bay leaf, 2-3 whole cloves, 1 star anise and 1 teaspoon shahi jeera. Let the spices sizzle for 30 seconds.\nThen add 1.5 teaspoon Kashmiri red chili powder and cook the chili powder in the oil for 10 to 15 seconds until you see a nice bright red color.\nThen add the finely chopped onion (from 1 medium red onion, I used my food/onion chopper to chop it really fine). Stir well and cook the onions for around 5 minutes, stirring often.\nAdd the finely chopped ginger and garlic (from 5 large garlic cloves and 1.5 inch ginger), stir and cook for 2 to 3 minutes.\nThen add tomatoes, puree or grate or use your food processor to really finely chop/blend 3 medium tomatoes and add that to the pan. Stir, then cover and and cook the tomatoes for 7 to 8 minutes until they are completely cooked and oil is oozing from the sides.\nAdd the spices- 1 teaspoon coriander powder, 1/2 to 3/4 teaspoon fennel powder (start with 1/2 and add remaining 1/4 if you prefer more of the fennel flavor), remaining 1/4 teaspoon of Kashmiri red chili powder (optional, replace with hot chili powder for a spicier curry), 3/4 teaspoon salt and 1 teaspoon sugar. Also add 1/4 cup water along with. Stir and cook the spices for 1 minute.\nThen add 3 tablespoons yogurt (make sure it's whisked and at room temperature) and stir continuously until it's all well combined. Reduce the quantity of yogurt to 2 tablespoons if the tomatoes are very tart/sour. Stir and cook for 2 more minutes.\nNow add 1/2 to 3/4 cup (4 oz to 6 oz) of water to the pan. You can adjust the amount of water to preference here. Mix well and let it come to a light simmer. Add 1.5 teaspoons kasuri methi and stir.\nFinally add in the fried cashews and stir well. Cook for 30 seconds. Then add 2 to 3 tablespoons heavy cream. Cook for 1 more minute and then turn off heat. Sprinkle garam masala and cardamom powder on top. Serve warm with naan or paratha. You may drizzle some cream on top before serving and garnish with cilantro.",
          "recipeDuration" : "45 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKaju%20Masala%2FImageimage%3A77?alt=media&token=d7364db6-2bed-4176-afaf-44cbb147cb7f",
          "recipeIngredients" : "Serves 4 people\n1 tablespoons +2 teaspoons ghee divided\n1 cup cashews whole raw cashews, 140 grams\n1 tablespoon oil\n1 inch cinnamon stick\n1 bay leaf\n3-4 cloves\n1 star anise\n1 teaspoon shahi jeera black cumin seeds or use regular cumin seeds\n1.5 teaspoons Kashmiri red chili powder not hot, used for bright red color\n1 medium red onion 170 grams, finely chopped using a food processor or chopper\n5 large garlic cloves 28 grams, finely chopped using a food processor or chopper\n1.5 inch ginger 16 grams, finely chopped using a food processor or chopper\n3 medium tomatoes 375 grams, pulsed in a food processor\n1 teaspoon coriander powder\n3/4 teaspoon fennel powder\n1/4 teaspoon Kashmiri red chili powder optional, you can use hot chili powder here for a spicier curry\n3/4 teaspoon salt or to taste\n1 teaspoon sugar\n3/4-1 cup water divided, as needed\n3 tablespoons plain yogurt whisked and at room temperature\n1.5 teaspoons kasuri methi crushed, dried fenugreek leaves\n2-3 tablespoons heavy cream adjust to taste + more for serving\ngaram masala to sprinkle\ncardamom powder to sprinkle",
          "recipeName" : "Kaju Masala",
          "recipeType" : "Lunch"
        }
      },
      "Masala Cashew" : {
        "-MiK60Vib_3UhiVpKQBN" : {
          "chefName" : "Sagar Kapoor",
          "countryName" : "India",
          "recipeDirections" : "Take cashews in a large bowl and add 1 teaspoon oil and toss the cashews until they are all coated with the oil. Set aside.\nTo another bowl add- besan, rice flour, ginger-garlic paste, Kashmiri red chili powder, turmeric, chaat masala, black pepper and salt.\nUsing a wire whisk, mix everything together until well combined.\nNow transfer this mixture to the bowl with cashews and toss it all together\nStart adding water, little by little now and keep mixing with your hands. Do not add more water than needed, you only need enough water for the spices to coat the cashews. Start with 1 tablespoon and then add more as needed.\nI added around 2 tablespoons water here and all cashews got coated with the spices and besan mixture.\nPre-heat air fryer at 325 F degrees for 2 minutes. Then place the cashews in a single layer into the air fryer. If there's any cashew which isn't coated with the masala, you can just press some on top of that.\nAir fry at 325 F degrees for 10 minutes, remember to give it a good shake at the half way mark.\nRemove the masala cashews from the air fryer and let them cool completely. They will crisp up as they cool. Store in an airtight container and enjoy with chai!",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Cashew%2FImageimage%3A90?alt=media&token=bd22a06f-7e75-4a3b-86c2-2e2f6ca79e26",
          "recipeIngredients" : "Serves 2 People\n1 cup cashews 150 grams\n1 teaspoon oil 5 ml, I used avocado oil\n1/2 cup besan 57 grams\n1 tablespoon rice flour 14 grams\n1 teaspoon ginger-garlic paste\n1.5 teaspoon kashmiri red chili powder not hot, replace 1/2 teaspoon with regular chili powder for spicy cashews\n1/8 teaspoon turmeric powder\n1 teaspoon chaat masala\n1/4 teaspoon black pepper or to taste\n1/2 teaspoon salt or to taste\nwater around 2 tablespoons",
          "recipeName" : "Masala Cashew",
          "recipeType" : "Snacks"
        }
      },
      "Mini Fruit Tart" : {
        "-MiKA18LBLMjYNNvpk6K" : {
          "chefName" : "Monesh",
          "countryName" : "Austria",
          "recipeDirections" : "Tart shells\nTake room temperature butter and confectioners sugar (also known as powdered sugar) in the steel bowl of your stand mixer or use your hand mixer.\nBeat the butter and sugar till creamy, around 2 minutes.\nNow add salt and all purpose flour to the butter and sugar mixture gradually.\nMix till the dough comes together. You know it's done when most of it sticks to the paddle attachment of your stand mixer.\nTake around 2 tablespoons of dough for each tart and press in to the bottom and sides of mini tart pans.\nRepeat till all the dough is over. I was able to get 14 mini tarts.\nBake at 350 F degrees for 15 minutes or till the tarts are lightly golden in color. Remove from oven and set aside to cool. [Tip: you may want to prick the tart dough with a fork so that it doesn't rise much during baking]\nFilling\nFor the filling, beat room temperature cream cheese till it's smooth and creamy.\nAdd Kool-Aid Easy Mix Tropical Punch and mix.\nFinally add confectioners sugar and mix till well combined.\nPipe the filling in the cooled baked tart sheets.\nTop with fruits of your choice and enjoy these mini fruits tarts immediately!",
          "recipeDuration" : "60 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMini%20Fruit%20Tart%2FImageimage%3A97?alt=media&token=1f165242-5d5c-4619-8ab1-bb668fa21462",
          "recipeIngredients" : "Tart shells\n1¾ cups all purpose flour\n¾ cup unsalted butter [1.5 sticks] at room temperature\n⅔ cup confectioners sugar also known as powdered sugar\n½ teaspoon salt\n¾ teaspoon vanilla extract\nFilling\n8 oz cream cheese\n2 tablespoons tropical punch [I used kool-aid easy mix tropical punch]\n2 tablespoons confectioners sugar also known as powdered sugar\nRaspberries, Blueberries, Kiwi, to decorate",
          "recipeName" : "Mini Fruit Tart",
          "recipeType" : "Other"
        }
      },
      "Poha Rice" : {
        "-MiJl-xmFAJxwaQbLI0r" : {
          "chefName" : "Vyshu",
          "countryName" : "India",
          "recipeDirections" : "To a strainer, add flattened rice (poha). Rinse it under running water until it turns soft. To check if it's done, press a flake between your thumb and index finger, it should break easily.\nAdd turmeric and 1/2 teaspoon salt to the poha and toss to combine. Set it aside while you make the tempering in the pan.\nHeat oil in a pan on medium heat. Once the oil is hot, add the mustard seeds and let them pop.\nThen add the peanuts and saute for a minute or two until they start turning brown.\nThen add the chopped onion, green chili and curry leaves. Cook for 2 minutes until the onions soften.\nAdd the green peas (which had been soaked in warm water for 10 minutes prior) and mix. Cook for 2 minutes until raw smell of peas goes away.\nThen add in the rinsed poha and toss to combine. Taste test some poha and if it feels dry, sprinkle little water all over (I usually do that). Cook for 1-2 minutes.  Also tastes test and add more salt as needed at this point (I added around 1/8 teaspoon).\nAlso add the sugar (if using) and cilantro.\nAnd then cover the pan with a lid and turn heat to low. Let it be like that for 2 minutes. Then turn off the heat.\nSqueeze in some fresh lemon juice. Garnish poha with more cilantro and sev and serve with a cuppa chai.",
          "recipeDuration" : "20 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPoha%20Rice%2FImageimage%3A63?alt=media&token=69ca220b-fdde-4da9-859a-107ec9d46761",
          "recipeIngredients" : "Serves 2 people\n1.5 cups poha 114 grams, use thick poha\n1/4 teaspoon turmeric\n1/2 teaspoon + 1/8 teaspoon salt divided, adjust to taste\n1/3 cup green peas I used frozen, soaked in warm water for 10 minutes\n2 teaspoons oil 10 ml, I used avocado oil\n1/2 teaspoon mustard seeds\n1.5 tablespoons raw peanuts\n1 small red onion chopped\n1 green chili chopped\n10-12 curry leaves\n1/4 teaspoon sugar optional\n1 tablespoon chopped cilantro + more to garnish\n1/2 lemon juice of\nsev to garnish",
          "recipeName" : "Poha Rice",
          "recipeType" : "Breakfast"
        }
      },
      "Pot Southwestern Pasta" : {
        "-MiK1tVtBqV1Lv4coWQ-" : {
          "chefName" : "Tiwari",
          "countryName" : "India",
          "recipeDirections" : "Press the saute button on the instant pot. And then press the adjust button to set saute to \"less\". Once it displays hot, add the olive oil. Then add the garlic, jalapeño, red onion and saute for 4 to 5 minutes until soft and fragrant.\nAdd the black beans, sweet corn, red pepper. Then add the taco seasoning and mix.\nStir in 1 cup water, followed by pasta and pasta sauce. Do not stir after adding the pasta sauce. You can spread it though over the pasta using a spatula.\nAdd salt and close the pot. Press the manual or pressure cook button and cook on high pressure for 6 minutes (I will probably do 4 minutes if using regular pasta in place of whole wheat).\nLet the pressure release naturally for 5 minutes and then do a quick pressure release.\nOpen the pot and stir everything together. Add the cilantro and mix. Also add the cheese and stir until it melts.\nCover the pasta with a lid for 2 to 3 minutes for all the flavors to mix in together after adding the cheese.\nServe southwestern pasta with more cilantro and avocados!\nStove-top Instructions\nBoil pasta according to instructions on the package. You can reserve some pasta water (around 1/4 cup) to thin out the sauce later.\nHeat olive oil in a pan on medium heat. Cook the garlic, onion, jalapeno for 4 to 5 minutes. Then add the beans, corn and pepper. Cook for 1 to 2 minutes and then add the taco seasoning. Cook for 30 seconds.\nAdd in the boiled pasta and pasta sauce. Mix everything together. You can add reserved water from boiling pasta at this point if the sauce looks thick.\nAdd the cilantro and cheese. Stir until the cheese melts. Serve pasta with cilantro and avocados.",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPot%20Southwestern%20Pasta%2FImageimage%3A87?alt=media&token=d408fdab-58b6-4bd3-b8a2-4bc0bd21f8b5",
          "recipeIngredients" : "Serves 4 People\n1.5 tablespoons olive oil 22 ml\n3-4 large garlic cloves chopped\n1/2 jalapeño de-seeded and chopped\n1 small red onion chopped\n1 cup black beans from a can\n1/3 cup sweet corn I used frozen corn\n1 medium red pepper sliced\n2 teaspoons taco seasoning or to taste\n1 cup water 8 oz\n8 oz penne pasta I used whole wheat, around 3 cups penne pasta\n1.5 cups pasta sauce 12 oz, I used Rao's marinara sauce\n1/2 teaspoon salt or to taste\n1-2 tablespoons chopped cilantro + more to garnish\n3/4 cup Mexican cheese blend shredded\ndiced avocados to serve, optional",
          "recipeName" : "Pot Southwestern Pasta",
          "recipeType" : "Dinner"
        }
      },
      "Schezwan Noodles" : {
        "-MiK3MBSJnC_i3qsaQEe" : {
          "chefName" : "KIM",
          "countryName" : "India",
          "recipeDirections" : "Before you start, boil noodles according to instructions on the package. I was supposed to boil mine for 3 to 4 minutes only. Once boiled, drain the noodles using a colander and then toss the noodles with 1 teaspoon oil so that they don't stick. Set aside.\nHeat a wok on medium-high heat. Once the oil is hot, add the oil. Then add the chopped garlic. Saute few seconds until garlic start changing color.\nThen add the sliced onion, chopped green onion and cook on high heat for 1-2 minutes.\nAdd sliced green pepper, red pepper and carrots and cook1 minute. Veggies should remain crunchy. Then add the shredded cabbage and cook for 1 more minute on high heat.\nLower the heat to medium and add schezwan sauce, followed by soy sauce, rice vinegar. Also add some salt to taste. Remember the schezwan sauce, soy sauce have salt in them already so add accordingly. Mix everything together and cook for 1 minute.\nAdd in the boiled noodles. Using a pair of tongs mix the noodles with the sauces, veggies until everything is well combined. Then remove pan from heat. Serve hot!",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSchezwan%20Noodles%2FImageimage%3A88?alt=media&token=fdda9b5c-2c92-404a-b628-21d174a1710c",
          "recipeIngredients" : "Serves 4 People\n1 tablespoon oil` 15 ml\n2-3 large garlic cloves finely chopped\n2-3 stalks green onion chopped\n1 medium red onion thinly sliced\n1 medium green pepper thinly sliced\n1 medium red pepper thinly spiced\n1-2 medium carrots thinly sliced\n1.5 cups cabbage shredded\n5-6 tablespoons schezwan sauce adjust to taste\n2 tablespoons soy sauce 30 ml\n1.5 tablespoons rice vinegar 22 ml\n1/2 teaspoon salt adjust to taste\n300 grams noodles I have used thin noodles (egg-free)",
          "recipeName" : "Schezwan Noodles",
          "recipeType" : "Snacks"
        }
      },
      "Thandai" : {
        "-MiK8ph9Xe9I1ZvcreDh" : {
          "chefName" : "Baby",
          "countryName" : "India",
          "recipeDirections" : "Make Thandai Masala/Paste\nFirst blanch the almonds. You can soak them overnight or soak in hot water for 15-20 minutes and then peel off the skin. It would easily come off.\nTransfer the blanched almond to a blender along with peppercorns, fennel seeds, poppy seeds, watermelon seeds and cardamom pods.\nGrind to a smooth paste. You may add little milk for grinding if needed. I didn't add any. This is the thandai masala, set it aside.\nMake Thandai\nAdd milk to a heavy bottom pan on medium heat. Stir in between and let it come to a slight boil. \nWhile the milk is getting heated up, remove 2 to 3 tablespoons of the hot milk from the pan and transfer to a small bowl. Crush saffron strands between your fingers and add it to the hot milk. Let it sit until it gets a nice yellow color.\nOnce milk comes to a boil, lower the heat and add the thandai masala to it. Use a wire whisk to mix it all together.\nThen add the sugar and mix until it dissolved. Turn off the heat.\nAdd the saffron-milk mixture to the pan and stir. Let the thandai sit like this for 30 minutes.\nAfter 30 minutes, add rose water and stir. Let it sit for another 30 to 60 minutes. This is important for the milk to absorb all the flavors of the spices before we strain it.\nAfter it's been sitting for a while and all the milk has absorbed all the flavors, strain the thandai using a sieve into a pitcher.\nPress the solid thandai masala that collects into the sieve with the back of a spoon as you strain it- this is to get the maximum flavors out of the spices into the thandai.\nTransfer the pitcher to a refrigerator and chill, preferably overnight. \nTo serve, pour thandai into glasses and garnish with sliced nuts like pistachios, almond, rose petals and saffron strands!",
          "recipeDuration" : "180 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FThandai%2FImageimage%3A95?alt=media&token=d42ced28-3bb8-4183-86da-249cbec954bd",
          "recipeIngredients" : "Thandai Masala\n35-40 almonds blanched\n20 black peppercorns whole\n4 teaspoons fennel seeds\n4 teaspoons poppy seeds\n2 tablespoon watermelon seeds\n15-20 green cardamom pods\nThandai\n1 liter whole milk around 4 cups\n1/2 cup sugar 100 grams, or to taste\n2-3 tablespoons rose water 30-45 ml\nstrands of saffron\nsliced nuts to garnish\nrose petals to garnish",
          "recipeName" : "Thandai",
          "recipeType" : "Drinks"
        }
      },
      "Upma Rava" : {
        "-MiJo4uh6xN5JhQEar-t" : {
          "chefName" : "Niharika",
          "countryName" : "India",
          "recipeDirections" : "Roast sooji on medium heat until fragrant, around 5 to 6 minutes, stirring continuously. Sooji shouldn't turn brown from bottom so be careful. Remove sooji from pan and transfer it to another bowl.\nYou can do this step of roasting sooji in advance and save time for busy mornings.\nTo the same pan now add 1.5 tablespoons oil on medium heat. Add mustard seeds and let them pop.\nThen add hing, cashews, chana & urad dal (which I soaked in water for 10 mins), ginger and saute for 1 minute until they start changing color.\nAdd onion, green chili and curry leaves. Cook for 2 minutes until the onions are soft. \nThen add the green peas and stir (I used frozen peas and soaked them in warm water for 10 mins before adding to the pan). Cook for 2 minutes until the raw smell of peas goes away.\nAdd 3 cups of water. Then add salt, chopped cilantro and lemon juice and mix well. You may also add sugar if you like little sweet taste in your upma. You may add 1/2 teaspoon sugar. I did not add any.\nNow let the water come to a boil. Once the water comes to a boil, start adding the roasted sooji little at a time.\nMix sooji after each addition in one direction with a wooden spatula. \nAdd all the sooji in similar way, little by little until all of it is absorbed by water.\nThen cover the pan with lid and set heat to low. Let it remain like that for 2 mins.\nRemove lid and add 1 teaspoon ghee. This is optional but recommended. Turn off the heat.\nMix the ghee with the upma and close lid again for few seconds. Remove the lid, fluff upma with a fork.\nServe upma warm with a side of coconut chutney!",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FUpma%20Rava%2FImageacc%3D1%3Bdoc%3D581?alt=media&token=ed3c14c4-3497-4a69-8146-a100420eb5ad",
          "recipeIngredients" : "Serves 3 people\n1 cup sooji/rava semolina, 182 grams\n1.5 tablespoons oil or can use ghee\n1 teaspoon mustard seeds\ngenerous pinch of hing also known as asafetida\n7-8 raw cashews broken\n1 teaspoon chana dal soaked in water for 10 mins\n1 teaspoon urad dal dhuli soaked in water for 10 mins\n1 teaspoon chopped ginger\n1 small red onion chopped, around 70 grams\n1 green chili chopped, or to taste\n12 curry leaves\n3 tablespoons green peas frozen\n3 cups water 24 oz\n3/4 teaspoon salt or to taste\n1 tablespoon chopped cilantro + more to garnish\n1 teaspoon lemon juice\n1 teaspoon ghee\nlemon wedges to serve",
          "recipeName" : "Upma Rava",
          "recipeType" : "Breakfast"
        }
      }
    },
    "NuxPL1bcAuUWmjpuEoVGC4vjjKS2" : {
      "Pancakes" : {
        "-MiKa_k9RhMCAON2B60-" : {
          "chefName" : "Ratan",
          "countryName" : "Canada",
          "recipeDirections" : "In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg.\n\nIn another bowl, beat the eggs and then whisk in the milk and vanilla.\n\nMelt the butter in a large cast iron skillet or griddle over medium heat.\n\nWhisk the butter into the milk mixture. Add the wet ingredients to the flour mixture, and whisk until a thick batter is just formed.\n\nKeeping the skillet at medium heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make 1 or 2 more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed.\n\nProcedure for adding fruit to pancakes: Once the bubbles break the surface of the pancakes, scatter the surface with sliced or diced fruit, or chocolate chips, nuts, etc. Flip with a spatula and cook for 1 minute more, being careful not to burn toppings",
          "recipeDuration" : "30 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPancakes%2FImageimage%3A39758?alt=media&token=55e10f1d-9548-4d75-a350-aa48ae01c5a6",
          "recipeIngredients" : "1 1/2 cups all-purpose flour\n\n3 tablespoons sugar\n\n1 tablespoon baking powder\n\n1/4 teaspoon salt\n\n1/8 teaspoon freshly ground nutmeg\n\n2 large eggs, at room temperature\n\n1 1/4 cups milk, at room temperature\n\n1/2 teaspoon pure vanilla extract\n\n3 tablespoons unsalted butter, plus more as needed",
          "recipeName" : "Pancakes",
          "recipeType" : "Breakfast"
        }
      }
    },
    "vwkNUIMU73QU2BIaltsXMcrSt0A2" : {
      "Apple Pie" : {
        "-MiJByw7Fet5m6nDT_DX" : {
          "chefName" : "Darshan",
          "countryName" : "United States",
          "recipeDirections" : "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\n\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust. Gently pour the sugar and butter liquid over the crust. Pour slowly so that it does not run off.\n\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.",
          "recipeDuration" : "90 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FApple%20Pie%2FImageimage%3A134159?alt=media&token=b5929a1e-e95a-4eab-b4f9-b249c19e037a",
          "recipeIngredients" : "1 recipe pastry for a 9 inch double crust pie\n\n½ cup unsalted butter\n\n3 tablespoons all-purpose flour\n\n¼ cup water\n\n½ cup white sugar\n\n½ cup packed brown sugar\n\n8 Granny Smith apples - peeled, cored and sliced",
          "recipeName" : "Apple Pie",
          "recipeType" : "Baking"
        }
      },
      "Baked Ricotta Cake" : {
        "-MiJBJCLnhB4lm8c8rYz" : {
          "chefName" : "Sunny",
          "countryName" : "United Arab Emirates",
          "recipeDirections" : "1.To make the pastry, place butter and 3/4 cup (165g) sugar in a stand mixer with the paddle attachment and beat until smooth. Beat in 1 egg until well combined. Fold in flour, baking powder and a pinch of salt. Cut one-third of the dough, flatten into a rectangle and enclose in plastic wrap. Shape the larger piece into a rectangle and enclose in plastic wrap. Chill both blocks of pastry for 2 hours.\n2.Preheat oven to 200°C. Grease a 20cm x 30cm x 5cm rectangular lamington pan and line with baking paper, leaving a 3cm overhang. Roll larger piece of pastry out between 2 sheets of lightly floured baking paper to 5mm thick. Use pastry to line the base of prepared pan, trimming the edges to fit snugly, then prick all over with a fork. Place pan on a baking tray and bake for 20-25 minutes until base is golden. Remove from oven and cool completely.\n3.Roll small pastry rectangle out between 2 sheets of floured baking paper into a 3mm-thick rectangle. Cut into long 6cm- wide strips to line the sides of the pan. Refrigerate while you make the filling.\n4.Reduce oven to 160°C. To make filling, lightly beat remaining 4 eggs. Place ricotta and cream cheese in a stand mixer with the paddle attachment and beat until smooth. Beat in vanilla, remaining 1 cup (220g) sugar and eggs to combine.\n5.Line sides of the pan with 6cm strips of pastry, gently pressing them onto top of cooked base to create a join (the pastry is soft, but will come together when cooked). Use a small sharp knife to trim the pastry so it’s flush with the top of the pan. Spoon filling into the pastry shell. Place pan on a baking tray and bake for 1 hour 20 minutes or until edges are set with a very slight wobble in the centre (it may crack a little, but will settle when it cools). Turn off the oven and set the door ajar with a wooden spoon. Leave the cake to cool completely in the oven, then chill for 6 hours to set. Use the baking paper overhang to carefully lift cake out of the pan. Dust cake with icing sugar to serve.",
          "recipeDuration" : "2 Hours",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBaked%20Ricotta%20Cake%2FImageimage%3A134158?alt=media&token=fdd59b8e-eef6-485e-854d-0c0e4648e550",
          "recipeIngredients" : "200g unsalted butter, chilled, chopped\n1 3/4 cup (385g) caster sugar\n5 eggs\n3 cups (450g) plain flour\n1 tsp baking powder\n700g fresh ricotta\n500g cream cheese, at room temperature\n2 tsp vanilla extract\nPure icing sugar, to dust",
          "recipeName" : "Baked Ricotta Cake",
          "recipeType" : "Desserts"
        }
      },
      "Blueberry Mint Cocktail" : {
        "-MiJC_xw-Cm5arb0d4UE" : {
          "chefName" : "Keshav",
          "countryName" : "Brazil",
          "recipeDirections" : "Combine blueberries, sugar, lemon juice, mint, and 1 1/3 cups water in a medium saucepan. Cook over medium heat, stirring occasionally, until blueberries begin to pop, 8 to 10 minutes; let cool. Discard mint. Transfer mixture to a blender and process until smooth.\nStrain mixture through a wire-mesh strainer into a pitcher. Stir in whiskey or mezcal, if desired. Serve over ice topped with club soda and garnished with mint",
          "recipeDuration" : "10 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBlueberry%20Mint%20Cocktail%2FImageimage%3A134160?alt=media&token=4ed9a6ff-9949-4419-89ae-faa027f08dc7",
          "recipeIngredients" : "2 c. blueberries\n1 c. sugar\n1/3 c. fresh lemon juice (from about 2 lemons)\n3 sprigs mint, plus more for garnish\n1 c. whiskey or mezcal, optional\nClub Soda",
          "recipeName" : "Blueberry Mint Cocktail",
          "recipeType" : "Drinks"
        }
      },
      "Chicken Parm Egg Rolls" : {
        "-MiJ9zryLidARuG32xWE" : {
          "chefName" : "Lalit",
          "countryName" : "Bulgaria",
          "recipeDirections" : "Place an egg roll wrapper on a clean surface in a diamond shape. Add 1 chicken tender half, a tablespoon marinara, a sprinkle of mozzarella, Parmesan, Italian seasoning, and basil. Wet corners slightly with water, then fold up bottom half and tightly fold in sides. Gently roll and seal tightly like a burrito. Repeat to make 11 more egg rolls.\nIn a large skillet over medium heat, heat 1/4” oil until it starts to shimmer. Add egg rolls and fry in batches until golden, 1 minute per side, adjusting heat as necessary. Transfer to a paper towel-lined plate to drain.\nGarnish egg rolls with Parmesan and serve with warm marinara for dipping.",
          "recipeDuration" : "30 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FChicken%20Parm%20Egg%20Rolls%2FImageimage%3A134157?alt=media&token=8cf68df3-d3b6-475b-bc06-6b550d94ab76",
          "recipeIngredients" : "12 egg roll wrappers\n6 chicken tenders, cooked according to package directions, halved lengthwise\n3/4 c. marinara, plus more for serving\n1 c. shredded mozzarella\n1/4 c. freshly grated Parmesan, plus more for garnish\n2 tsp. dried oregano (or Italian seasoning)\n1/3 c. freshly sliced basil \nCanola oil, for frying",
          "recipeName" : "Chicken Parm Egg Rolls",
          "recipeType" : "Appetisers"
        }
      },
      "Dal Makhni" : {
        "-MiJ6uIsI3aEcGc-6iYC" : {
          "chefName" : "Shah Rukh Khan",
          "countryName" : "Bangladesh",
          "recipeDirections" : "1. Wash and rinse urad dal (whole black lentil) and rajma (kidney beans) in a large bowl. Soak in 3 cups water overnight.\nIn the morning, drain the water in which the dal and rajma was soaked. Transfer the dal and rajma to a pressure cooker with 1 teaspoon salt. Add around 3.5 cups water. \nPressure cook on high-medium heat for 10 whistles, then lower the heat to low-medium and cook for another 10 minutes. In total around 15 to 20 whistles.\nLet the pressure release naturally. The dal and rajma should be completely cooked and you should be able to mash them with your fingers. \nIf using the Instant pot, pressure cook the lentils on high pressure for 30 minutes with natural pressure release.\nMash some of the dal and rajma using a potato masher. Then turn on the heat to lowest heat and let the dal simmer while you make the masala.\nTo make the masala, in a large pot/pan, heat 2 tablespoons butter  (I use and recommend amul salted butter here) and 1 tablespoon ghee on medium heat.\nOnce the butter melts and is hot, add the finely grated onion. Cook the onion for around 6 to 7 minutes or until it turns light golden brown. Keep stirring it continuously so that it doesn't burn and keep heat on medium.\nAdd the ginger garlic paste and cook for 1 to 2 minute until the raw smell goes away.\nAdd the tomato puree and mix. Cook for 2 minutes or until the puree mixes well with masala and oil starts oozing out from the sides.\nAdd in the boiled dal (which had been simmering for around 10 to 15 mins you were making the masala) and mix. \nAdd garam masala, kashmiri red chili powder and salt. Mix to combine. \nAdd 1/2 cup water, stir and set heat to low. Let it simmer on low heat uncovered for around 45 minutes. \nStir often (every 10 minutes or so) else dal will stick to the bottom of the pot. You will also need to add water. I added total of 1.5 cups water as the dal was simmering.\nAdd sugar and mix after the dal has simmered for 45 minutes.\nAlso add the remaining 1 tablespoon butter and 1/4 cup cream. Mix well.\nSimmer for 10 more minutes on low heat after adding the cream. Dal will become really creamy by now. You may serve the dal at this point or do the additional step of giving it a smokey flavor.\nThis last step (dhungar method) is optional but recommend. For the smokey flavor, place a steel bowl on top of a trivet placed inside the dal. Then heat a piece of charcoal over direct heat until its red hot.\nPlace hot charcoal in that steel bowl on top of the trivet. Pour melted ghee (around 1 tablespoon) on top of charcoal.\nYou will immediately see fumes coming out of charcoal. Immediately close the pan with a lid. Let it remain like this for 2 minutes. After 2 minutes, remove lid and remove the bowl from dal. The longer you keep the lid closed, the smokier dal will get and for dal makhani I don't like it very smokey so 2 minutes was good for me. You may do 5 minutes but don't do more.\nGarnish dal makhani with more cream and serve with a pat of amul butter. Enjoy",
          "recipeDuration" : "2 Hours",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FDal%20Makhni%2FImageimage%3A134151?alt=media&token=1546890b-8ce2-4d0e-a923-a75496db0246",
          "recipeIngredients" : "To Pressure Cook\n▢3/4 cup urad dal sabut (whole black lentil) 165 grams\n▢1/4 cup rajma (red kidney beans) 60 grams\n▢1 teaspoon salt\n▢3.5 cups water 28 oz\nMasala for the Dal\n▢1 tablespoon ghee\n▢3 tablespoons butter divided, use amul butter (salted) if possible\n▢1 medium white onion 115 grams, finely grated using a food processor\n▢2 teaspoons ginger garlic paste use fresh paste if possible\n▢1/2 cup tomato puree use store bought tomato puree\n▢1/2 teaspoon kashmiri red chili powder\n▢1/4 teaspoon garam masala\n▢1/2 teaspoon salt or to taste\n▢1.5 cups water 12 oz, as needed\n▢1/2 teaspoon sugar\n▢1/4 cup cream 60 ml\n▢more amul butter (salted) for serving\n▢piece of charcoal optional, for giving dal a smokey flavor",
          "recipeName" : "Dal Makhni",
          "recipeType" : "Lunch"
        }
      },
      "Honey Garlic Glazed Salmon" : {
        "-MiJ7nSnKYo1PwMve9-2" : {
          "chefName" : "Gordan Ramsey",
          "countryName" : "Turkey",
          "recipeDirections" : "In a medium bowl, whisk together honey, soy sauce, lemon juice and red pepper flakes.\nIn a large skillet over medium-high heat, heat two tablespoons oil. When oil is hot but not smoking, add salmon skin-side up and season with salt and pepper. Cook salmon until deeply golden, about 6 minutes, then flip over and add remaining tablespoon of oil.\nAdd garlic to the skillet and cook until fragrant, 1 minute. Add the honey mixture and sliced lemons and cook until sauce is reduced by about 1/3. Baste salmon with the sauce.\nGarnish with sliced lemon and serve.",
          "recipeDuration" : "25 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FHoney%20Garlic%20Glazed%20Salmon%2FImageimage%3A134152?alt=media&token=331a108a-d28a-43a5-9c68-6544d413e0d0",
          "recipeIngredients" : "1/3 c. honey\n1/4 c. soy sauce\n2 tbsp. lemon juice\n1 tsp. red pepper flakes\n3 tbsp. extra-virgin olive oil, divided\n4 6-oz. salmon fillets, patted dry with a paper towel\nKosher salt\nFreshly ground black pepper\n3 cloves garlic, minced\n1 lemon, sliced into rounds",
          "recipeName" : "Honey Garlic Glazed Salmon",
          "recipeType" : "Dinner"
        }
      },
      "Masala Tea" : {
        "-MiJ4yzLStKvXlPkDuef" : {
          "chefName" : "Varsha",
          "countryName" : "India",
          "recipeDirections" : "Boil water\nAdd tea leaves and Mint leaves\nAdd sugar and boil it for 2 minutes\nAdd milk and wait for boil to come\nWhen you see boil add ginger in it\nBoil it for more 5 minutes and Masala Tea is ready\nServe it with Biscuits",
          "recipeDuration" : "10 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Tea%2FImageimage%3A134143?alt=media&token=bafae1c0-d00d-49b7-bcb5-ff5e4e9f4483",
          "recipeIngredients" : "1cup Milk\n1tbsp Tea leaves\n¼cup Water\n2tbsp Sugar\n½tbsp Ginger (Shredded)\n4 Mint leaves",
          "recipeName" : "Masala Tea",
          "recipeType" : "Breakfast"
        }
      },
      "Maska Bun" : {
        "-MiJL-YGJNuQgLDPKRiK" : {
          "chefName" : "Pranav",
          "countryName" : "Pakistan",
          "recipeDirections" : "• First Cut the bun into 2 parts horizontally\n\n• Spread the butter and Jam on both side",
          "recipeDuration" : "5 minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMaska%20Bun%2FImageimage%3A134149?alt=media&token=24281813-1462-4908-99a3-5b2a47e5c2f4",
          "recipeIngredients" : "• 1 bun\n• 2tbsp Butter\n• 2tbsp Mix fruit jam",
          "recipeName" : "Maska Bun",
          "recipeType" : "Brunch"
        }
      },
      "Meggie" : {
        "-MiJ9RIcz8JedwFW6fsq" : {
          "chefName" : "Raheem",
          "countryName" : "India",
          "recipeDirections" : "firstly, in a large kadai heat oil and saute garlic.\n\nfurther add onion, and saute till they change colour.\n\nalso add capsicum and saute for a minute.\n\nadditionally add tomato and saute till they turn soft and mushy.\n\nfurthermore, add ¼ cup of brocolli and ¼ cup of peas. saute for 2 minutes.\n\nalso add ½ tsp turmeric powder, ½ tsp red chilli powder and ¼ tsp garam masala powder. saute for a minute on low flame.\n\nadd 2 cups of water and get to boil.\n\nonce the water begins to boil, add 2 sachets maggi masala and salt.\n\nstir well and get the water to boil.\n\nadd in 2 maggi noodles breaking into 2 half.\n\nspread and cook both the sides.\n\nboil for 2 minutes and stir occasionally.\n\ncook till the noodels absorb water and gets cooked completely.\n\nsprinkle chaat masala for more flavours just before serving.\n\nfinally, maggi masala recipe is ready to be served hot.",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134155?alt=media&token=eda4e2d1-5f72-48db-a002-e558a29654a1",
          "recipeIngredients" : "1 pack Maggi Noodles or Instant Ramen Noodles\n1 teaspoon Oil\n2 Garlic Cloves finely chopped\n1 cup Mushrooms diced\n1/2 cup Red Pasta Sauce\n1/4 teaspoon Oregano dried\n2 tablespoons Olives sliced\nA few Basil leaves\n2 tablespoon Parmesan grated\nSalt to taste",
          "recipeName" : "Meggie",
          "recipeType" : "Snacks"
        }
      }
    },
    "w5Qu04DZnsOtXzYeTGVk3b3gozj2" : {
      "Brownies" : {
        "-MiKenSu0CDNZ215Qmsf" : {
          "chefName" : "Budha lal Chuno",
          "countryName" : "Cook Islands",
          "recipeDirections" : "Preheat the oven to 325°F. Lightly spray an 8x8 baking dish (not a 9x9 dish or your brownies will overcook) with cooking spray and line it with parchment paper. Spray the parchment paper.\nIn a medium bowl, combine the sugar, flour, cocoa powder, powdered sugar, chocolate chips, and salt.\nIn a large bowl, whisk together the eggs, olive oil, water, and vanilla.\nSprinkle the dry mix over the wet mix and stir until just combined.\nPour the batter into the prepared pan (it'll be thick - that's ok) and use a spatula to smooth the top. Bake for 40 to 48 minutes, or until a toothpick comes out with only a few crumbs attached (note: it's better to pull the brownies out early than to leave them in too long). Cool completely before slicing.*** Store in an airtight container at room temperature for up to 3 days. These also freeze well!",
          "recipeDuration" : "45 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBrownies%2FImageimage%3A39767?alt=media&token=d3717769-39f7-4025-81fa-c5b716929c55",
          "recipeIngredients" : "1 1/2 cups granulated sugar*\n3/4 cup all-purpose flour\n2/3 cup cocoa powder, sifted if lumpy\n1/2 cup powdered sugar, sifted if lumpy\n1/2 cup dark chocolate chips\n3/4 teaspoons sea salt\n2 large eggs\n1/2 cup canola oil or extra-virgin olive oil**\n2 tablespoons water\n1/2 teaspoon vanilla",
          "recipeName" : "Brownies",
          "recipeType" : "Baking"
        }
      },
      "Chickpea Salad Sandwiches" : {
        "-MiKcOGPPsJ4CGgaJ6t4" : {
          "chefName" : "Omerta",
          "countryName" : "Australia",
          "recipeDirections" : "Mash the chickpeas, mayonnaise, lemon juice, dill, capers, mustard, turmeric, 1/2 teaspoon salt and several grinds of pepper in a large bowl with a fork or potato masher, scraping down the sides of the bowl with a rubber spatula as needed, until the chickpeas are crushed and the salad is slightly chunky. Taste and adjust the seasoning with salt and pepper.\nSpread the salad onto 2 slices of the bread, top with the pepitas and baby kale and then sandwich with the remaining 2 slices bread. Serve immediately.",
          "recipeDuration" : "15 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FChickpea%20Salad%20Sandwiches%2FImageimage%3A39761?alt=media&token=9c6d6934-5674-41e8-97ad-ec5a8f6e449f",
          "recipeIngredients" : "One 15-ounce can chickpeas, drained and rinsed\n\n3 tablespoons mayonnaise or vegan mayonnaise spread\n\n1 tablespoon fresh lemon juice\n\n1 tablespoon roughly chopped fresh dill\n\n2 teaspoons capers\n\n1 1/2 teaspoons stone-ground mustard\n\n1/2 teaspoon ground turmeric\n\nKosher salt and freshly ground black pepper\n\n2 tablespoons roasted unsalted pepitas\n\n1 cup lightly packed baby kale\n\n4 slices whole wheat bread, toasted",
          "recipeName" : "Chickpea Salad Sandwiches",
          "recipeType" : "Lunch"
        }
      },
      "Egg Curry" : {
        "-MiKdHiNcTAwa6k6k50K" : {
          "chefName" : "Dhiru baba",
          "countryName" : "India",
          "recipeDirections" : "go to homepage\nHome » Lunch and Dinner Recipes » Dhaba Style Egg Curry\n\nLast Updated: Jun 14, 2021 By Subhasmita\n\nDhaba Style Egg Curry\n Recipe\nEgg Curry is a deliciously rich onion tomato gravy, tastes exactly like the ones you get in dhabas. These are perfect with some rice or paratha and fresh salad on the side. Step by step video included after the recipe.\nPicture of Egg Curry in a deliciously rich onion tomato gravy in a pan with a spoon.\n\nThis Egg curry reminds me of the rustic egg curries you get in dhabas.  Rich, spicy Onion tomato gravy with oil oozing on the sides and a smokey flavour. It pairs perfectly with naan or paratha.\n\nTrips on Indian highways are incomplete without a stop at Dhabas. You might not get an elaborate menu in those places but you will definitely get hot fresh. Naan, Tandoori roti, dal fry, chana masala, egg curry, chicken curry are few of my favourites, of course with lots of onion, lemon and green chilli.\n\nEgg Curry is a deliciously rich onion tomato gravy, tastes exactly like the ones you get in dhabas. These are perfect with some rice or paratha and fresh salad on the side.\n\nHow To Make Perfect Hard Boiled Egg?\nI know boiling eggs is not something, you all need to learn. I mean, it is so basic, who needs a recipe for that. But I often hear people struggling to get perfectly boiled and peeled eggs. So here is the thing, to get perfectly boiled eggs there are two things that matter. One is the cooking time and the second thing is the age of the egg.\n\nMushroom Cheese Stuffed Chicken Breast Recipe.mp4\n×\nThe egg needs to be fresh. If the eggs are older, then I often find it becomes difficult to peel them. Put eggs in a pan, cover with water. Bring it to a boil and boil for 6-7 minutes. Using a slotted spoon remove and put it in cold water. Once the temperature comes down and is easy to handle, peel the eggs.\n\n\n\nHow To Make Spicy Egg Curry?\nThe procedure for making this egg curry is just like any other curry. It starts with making the onion tomato base.\n\nMost of the egg curries don't call for frying egg before adding it to the gravy. But I love to toast eggs until some brown patches appear. It enhances the flavour. Toss egg in a little salt, turmeric and chilli powder. Add in very hot oil and toss it until you see small brown patches.\n\n\nTo the same pan add butter and fry dry red chilli until smokey. Saute onion until it is softened and start to brown. Sauteeing onion to the right stage is very important. Raw bite of onion in the gravy is not pleasant to experience. Next, add ginger garlic paste and saute until the raw smell is gone.\n\nAdd all the spice powder except garam masala and salt. Saute until the mixture is fragrant. Keep an eye in this step. You can also mix the dry spice in ¼ cup of water and add to the pan. Sauteing dry spices in the oil helps release flavour.\n\nAdd chopped tomatoes and saute until the mixture comes together. Add green chilli and crushed Kasuri methi.\n\n\nEgg Curry is a deliciously rich onion tomato gravy, tastes exactly like the ones you get in dhabas. These are perfect with some rice or paratha and fresh salad on the side. Tips For The Best Egg Curry\n\nWhile cooking onion, sprinkle a big pinch of salt. This helps to sweat onion faster.\nIf you are worried about burning spices after adding it to the pan, mix all the spices to ¼ cup water, make a paste. Add it to the pan.\nTo fasten the cooking of tomatoes, slit the tomatoes (not deep) and microwave for 5 minutes. Once it has cooled down, chop.\nFor best flavours, add freshly ground spices or at least spices that are not more than 10 days old. I always make small batch of spice powder for 8-10 days.\nLove Curry?? Here are a few more curries\nCHICKPEA CURRY\n\nGOAN PRAWN CURRY\nCREAMY CAULIFLOWER CURRY\nEgg Curry is a deliciously rich onion tomato gravy, tastes exactly like the ones you get in dhabas. These are perfect with some rice or paratha and fresh salad on the side.\nSpicy Egg Curry\nEgg curry with a rich delicious onion tomato gravy is easy to make and best pairs with rice or paratha(flatbread).\n4.79 from 19 votes\n Print  Pin  Rate\nCourse: Side DishCuisine: Indian Prep Time: 15 minutesCook Time: 20 minutes Servings: 6 servings Calories: 144kcal\n\nIngredients\n6 Eggs\nFor roasting egg\n1 tablespoon Oil\n¼ teaspoon Salt\n¼ teaspoon Turmeric Powder\n¼ teaspoon Chilli Powder\nFor gravy\n1 tablespoon Oil\n1 tablespoon Butter\n2 medium Onion (Finely Chopped about 1 cup)\n1 tablespoon Ginger Garlic Paste\n½ cup Finely chopped Tomatoes\n1 tablespoon Coriander Powder\n1 teaspoon Cumin Powder\n½ teaspoon Red Chilli Powder\n½ teaspoon Kashmiri Red Chilli (Substitute by Paprika)\n½ teaspoon Turmeric powder\n1 green Chilli chopped (optional)\n½ teaspoon Garma Masala\n1 tablespoon Kasuri Methi (dried fenugreek leaves)\n1.5 cup Water\nsalt to taste\n\nInstructions\nIn a pan cover eggs with cold water. Let it come to a boil.Cook eggs 6-7 minutes. Transfer eggs to cold water. When it is comfortable to handle, peel.\nToss peeled boiled eggs in ¼ each of salt, turmeric, and chili powder.\nHeat oil in a pan. When the oil is hot, add eggs to the pan. Toss in medium-hot until you see small brown blisters. Remove and keep aside.\nTo the same pan add 1 tablespoon of oil and butter. When hot add dry red chili and saute for 30 seconds until smokey.\n\nAdd chopped onion, saute for 3-4 minutes. The onion will soften and start to brown.\nAdd ginger-garlic paste. Saute for a minute, stirring in between.\nWhen there is no raw smell of ginger garlic, lower heat. Add cumin powder, coriander powder, turmeric, red chilli powder, Kashmiri red chilli powder. Saute for 30 seconds, until aromatic. Sprinkle little water to prevent it from burning.\nAdd chopped tomatoes. Cook until tomato is soft and mushy.\nAdd chopped green chilli and crushed Kasuri methi. Mix well.\n\nWhen you see oil separating from the mixture, it is time to add water.\nSeason with salt, add garam masala and fried eggs to the pan.\nMix everything and cook for another 2-3 minutes.\nGarnish with fresh coriander leaves.",
          "recipeDuration" : "45 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FEgg%20Curry%2FImageimage%3A39764?alt=media&token=52169997-8016-4134-975a-fd0818efb744",
          "recipeIngredients" : "6 Eggs\nFor roasting egg\n1 tablespoon Oil\n¼ teaspoon Salt\n¼ teaspoon Turmeric Powder\n¼ teaspoon Chilli Powder\nFor gravy\n1 tablespoon Oil\n1 tablespoon Butter\n2 medium Onion (Finely Chopped about 1 cup)\n1 tablespoon Ginger Garlic Paste\n½ cup Finely chopped Tomatoes\n1 tablespoon Coriander Powder\n1 teaspoon Cumin Powder\n½ teaspoon Red Chilli Powder\n½ teaspoon Kashmiri Red Chilli (Substitute by Paprika)\n½ teaspoon Turmeric powder\n1 green Chilli chopped (optional)\n½ teaspoon Garma Masala\n1 tablespoon Kasuri Methi (dried fenugreek leaves)\n1.5 cup Water\nsalt to taste",
          "recipeName" : "Egg Curry",
          "recipeType" : "Dinner"
        }
      },
      "Lemonade" : {
        "-MiKdrOCbHu-RPaCAwUL" : {
          "chefName" : "Meethesh",
          "countryName" : "Finland",
          "recipeDirections" : "In a small saucepan, combine sugar and 1 cup water. Bring to boil and stir to dissolve sugar. Allow to cool to room temperature, then cover and refrigerate until chilled.\n\nRemove seeds from lemon juice, but leave pulp. In pitcher, stir together chilled syrup, lemon juice and remaining 7 cups water.",
          "recipeDuration" : "10 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FLemonade%2FImageimage%3A39766?alt=media&token=a7b2e245-0139-44ce-afda-6d762f8aee7f",
          "recipeIngredients" : "1 ¾ cups white sugar\n\n8 cups water\n\n1 ½ cups lemon juice",
          "recipeName" : "Lemonade",
          "recipeType" : "Drinks"
        }
      },
      "Mexican Chicken soup" : {
        "-MiKcgxH6wsZBP_4VgYg" : {
          "chefName" : "Kyle Kumar",
          "countryName" : "Switzerland",
          "recipeDirections" : "Heat the oil in a medium saucepan over medium heat. Add the onion, celery, garlic, chili powder, and cumin, and cook until the onion softens, about 5 minutes. Add the chicken broth, bring to a boil, reduce the heat slightly, and simmer, uncovered, for 10 minutes. Add the green chiles, posole, tomatoes, and oregano and cook for another 5 minutes.\nPull the saucepan from the heat and stir in the chicken, cilantro leaves, and lime juice. Season, to taste, with salt and pepper. Serve hot.",
          "recipeDuration" : "65 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMexican%20Chicken%20soup%2FImageimage%3A39762?alt=media&token=bada9a4f-514e-4d67-a936-e4020e84709a",
          "recipeIngredients" : "2 tablespoons canola oil\n\n1 medium onion, chopped\n\n1 medium rib celery, chopped\n\n2 garlic cloves, minced\n\n1 tablespoon chili powder\n\n1 teaspoon ground cumin\n\n6 cups chicken broth, low-sodium canned\n\n1/4 cup canned green chiles\n\n1 (15 1/2-ounce) can posole, drained or frozen corn kernels\n\n4 canned whole peeled tomatoes, roughly chopped\n\n1 teaspoon dried oregano\n\n1 cup cooked skinless shredded chicken breast (about 4 ounces)\n\n1/4 cup chopped fresh cilantro leaves\n\nJuice of 1 lime\n\nKosher salt and freshly ground black pepper",
          "recipeName" : "Mexican Chicken soup",
          "recipeType" : "Lunch"
        }
      },
      "Oven baked omelet" : {
        "-MiKbyapAamddggtI9vT" : {
          "chefName" : "Omel Banin",
          "countryName" : "Argentina",
          "recipeDirections" : "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish with butter.\n\nBeat eggs, sour cream, milk, and salt in a bowl until blended. Stir in green onions. Pour mixture in the prepared baking dish.\n\nBake in the preheated oven until set, 25 to 30 minutes. Sprinkle Cheddar cheese over eggs and continue baking until cheese is melted, 2 to 3 minutes more.",
          "recipeDuration" : "40 Minutes",
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FOven%20baked%20omelet%2FImageimage%3A39759?alt=media&token=67eed627-b730-4f3f-bcdb-4a1c6e0fd9f1",
          "recipeIngredients" : "1 teaspoon butter\n\n9 large eggs\n\n½ cup sour cream\n\n½ cup milk\n\n1 teaspoon salt\n\n2 green onions, chopped\n\n¼ cup shredded Cheddar cheese",
          "recipeName" : "Oven baked omelet",
          "recipeType" : "Breakfast"
        }
      }
    }
  },
  "User Recipe Images" : {
    "IUKcsosLqFhWyuOtagcogza25QJ2" : {
      "Aloo puri" : {
        "-MiJ7_z2PvdcQrfVLWK7" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FAloo%20puri%2FImageimage%3A151109?alt=media&token=b5015fec-140b-4e7c-ae62-acbef28c1010",
          "recipeName" : "Aloo puri"
        }
      },
      "Coconut pudding" : {
        "-MiJ8ghqaPVItApjGFAH" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCoconut%20pudding%2FImageimage%3A151111?alt=media&token=2ff06e7c-b038-4a8a-bf01-d806c7b540e6",
          "recipeName" : "Coconut pudding"
        }
      },
      "Grilled sandwich" : {
        "-MiJ86IIBZNvGZUMj53c" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FGrilled%20sandwich%2FImageimage%3A151110?alt=media&token=459cf919-80fd-4232-b3be-9540036ef014",
          "recipeName" : "Grilled sandwich"
        }
      },
      "Milk powder burfi" : {
        "-MiKZMPPh12_YkYa4yYB" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMilk%20powder%20burfi%2FImageimage%3A151129?alt=media&token=8f757b5d-39a0-487e-9771-5ebe7bbfce3f",
          "recipeName" : "Milk powder burfi"
        }
      },
      "Rava laddu" : {
        "-MiKYfsH2-lJjYuV_H9u" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FRava%20laddu%2FImageimage%3A151128?alt=media&token=25434270-a5b2-4370-a1bb-6d3f0c3aa8da",
          "recipeName" : "Rava laddu"
        }
      },
      "Sahi Paratha" : {
        "-MiJ6NqrzNFUQNuicGbi" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSahi%20Paratha%2FImageimage%3A151106?alt=media&token=e65961e0-8655-4cd0-b6c3-766c051a004f",
          "recipeName" : "Sahi Paratha"
        },
        "-MiJ6Nv4a1C4xv_nqood" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSahi%20Paratha%2FImageimage%3A151107?alt=media&token=8b6183db-7c4f-4d22-874f-1a59fa69962c",
          "recipeName" : "Sahi Paratha"
        }
      },
      "classic caesar" : {
        "-MiJ9oXvtVhbsASDKesQ" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fclassic%20caesar%2FImageimage%3A151112?alt=media&token=4579fd58-85ec-4d5a-930c-f0b8b15c1fa4",
          "recipeName" : "classic caesar"
        },
        "-MiJ9oYqaBWDq0BuJDmV" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fclassic%20caesar%2FImageimage%3A151113?alt=media&token=dac74593-8146-4ac1-8f70-e0270427c07c",
          "recipeName" : "classic caesar"
        }
      },
      "idli" : {
        "-MiJ5iNk-VTNlfRBQt7D" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151099?alt=media&token=c770198a-b7c1-4ef3-ae85-52383f1fabae",
          "recipeName" : "idli"
        },
        "-MiJ5iRy8mLT29qQ74Qv" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151099?alt=media&token=f693b5b7-6d63-4eb3-bb08-5d4fe920adfd",
          "recipeName" : "idli"
        },
        "-MiJ5ihPNIGhhatq6D4A" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151105?alt=media&token=fef50e4b-82c4-481b-bf55-72348f249e8f",
          "recipeName" : "idli"
        },
        "-MiJ5intcD8xk1RCCnfL" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151105?alt=media&token=e7a16b86-ccf6-4144-b30f-80169591f34f",
          "recipeName" : "idli"
        },
        "-MiJ5j0JmTJI6ROWCBF9" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151105?alt=media&token=5761707f-c8d0-4ece-bda6-f31a56b43028",
          "recipeName" : "idli"
        },
        "-MiJ5j82-bzfkb_-EGU7" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151105?alt=media&token=4e99aeba-14b6-456a-a88c-1e0b31b6f9d9",
          "recipeName" : "idli"
        },
        "-MiJ5jLBgpW4Vwfwnlli" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fidli%2FImageimage%3A151105?alt=media&token=0e4ca8e1-bc57-41d5-933b-be45a0389a29",
          "recipeName" : "idli"
        }
      },
      "panneer butter masala" : {
        "-MiJ6ys53NJ5_bRBy4jX" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fpanneer%20butter%20masala%2FImageimage%3A151108?alt=media&token=c8ee5e80-1043-4e1b-aecb-f8f769c249da",
          "recipeName" : "panneer butter masala"
        }
      },
      "peanut butter cookies" : {
        "-MiJBYQsqi1juBw4Xa8k" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2Fpeanut%20butter%20cookies%2FImageimage%3A151114?alt=media&token=419c59e1-8d2c-4a45-a3d6-fc763fff757b",
          "recipeName" : "peanut butter cookies"
        }
      }
    },
    "JuWdaR5kewMTa2oaSO0p4GOStVu1" : {
      "Badami Milk" : {
        "-MiK7IgHQZxM1cAK2tPr" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBadami%20Milk%2FImageimage%3A91?alt=media&token=c7819763-f21a-4e3b-93e9-9b18afc7903f",
          "recipeName" : "Badami Milk"
        },
        "-MiK7IhQFlFgtlgKqIkJ" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBadami%20Milk%2FImageimage%3A92?alt=media&token=88200986-328e-4fa6-98a4-58f1a3129a2a",
          "recipeName" : "Badami Milk"
        }
      },
      "Carrot Cake Cookies" : {
        "-MiJr6h--TtjndwBTi4G" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCarrot%20Cake%20Cookies%2FImageimage%3A71?alt=media&token=cc432d90-4298-4765-b251-a89eeda25368",
          "recipeName" : "Carrot Cake Cookies"
        },
        "-MiJr6lGdDs6enIpU-yp" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCarrot%20Cake%20Cookies%2FImageimage%3A72?alt=media&token=49dde8b6-e417-4ef8-9744-5e180143185d",
          "recipeName" : "Carrot Cake Cookies"
        },
        "-MiJr6wLxPZdq9Nk4VQO" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCarrot%20Cake%20Cookies%2FImageimage%3A75?alt=media&token=e694bab0-d889-42e7-b666-382841f22d1b",
          "recipeName" : "Carrot Cake Cookies"
        },
        "-MiJr7-s9cn5G84Xp-PZ" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCarrot%20Cake%20Cookies%2FImageimage%3A74?alt=media&token=354c3f66-43ad-4baa-b9f5-158d8a691e2f",
          "recipeName" : "Carrot Cake Cookies"
        }
      },
      "Cinnamon Rolls" : {
        "-MiJpvVydW0VnwXi0aAj" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCinnamon%20Rolls%2FImageimage%3A69?alt=media&token=cae82233-c425-4630-9ae1-4024bef25c41",
          "recipeName" : "Cinnamon Rolls"
        },
        "-MiJpvmX8wHHdreIzWOt" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FCinnamon%20Rolls%2FImageimage%3A70?alt=media&token=12374020-c953-415c-b776-45812772d4e4",
          "recipeName" : "Cinnamon Rolls"
        }
      },
      "Kadai Chole" : {
        "-MiK-0_JAWIMW8erZjdh" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKadai%20Chole%2FImageimage%3A83?alt=media&token=13a131f4-8184-4000-9b55-5324964a84ce",
          "recipeName" : "Kadai Chole"
        },
        "-MiK-0kWM_B9MfJsb35k" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKadai%20Chole%2FImageimage%3A84?alt=media&token=823f2b80-3fac-49ad-955d-fe14b580a6f5",
          "recipeName" : "Kadai Chole"
        },
        "-MiK-0pe885L2nS78CxM" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKadai%20Chole%2FImageimage%3A80?alt=media&token=2f15eea1-ed3e-405f-8afc-08e3473edf2e",
          "recipeName" : "Kadai Chole"
        }
      },
      "Kaju Masala" : {
        "-MiJy7MBXAQNvcdel6xn" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKaju%20Masala%2FImageimage%3A77?alt=media&token=d7364db6-2bed-4176-afaf-44cbb147cb7f",
          "recipeName" : "Kaju Masala"
        },
        "-MiJy7QC3QAI4Ln0U0oO" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKaju%20Masala%2FImageimage%3A76?alt=media&token=ecd63ae1-ebd2-413b-a67a-6fa2139e5ae5",
          "recipeName" : "Kaju Masala"
        },
        "-MiJy7gc6AbtISYtGfRm" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FKaju%20Masala%2FImageimage%3A78?alt=media&token=e3b6ab8d-d2d0-4e28-9dc2-dfc20eed5c75",
          "recipeName" : "Kaju Masala"
        }
      },
      "Masala Cashew" : {
        "-MiK60VmD-ri3BFsJL4b" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Cashew%2FImageimage%3A90?alt=media&token=bd22a06f-7e75-4a3b-86c2-2e2f6ca79e26",
          "recipeName" : "Masala Cashew"
        },
        "-MiK60_lyDoGTAS5hiah" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Cashew%2FImageimage%3A89?alt=media&token=37262520-bf46-47b5-8de7-10083c064e3b",
          "recipeName" : "Masala Cashew"
        }
      },
      "Mini Fruit Tart" : {
        "-MiKA18MIZmAVGKC70sj" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMini%20Fruit%20Tart%2FImageimage%3A97?alt=media&token=1f165242-5d5c-4619-8ab1-bb668fa21462",
          "recipeName" : "Mini Fruit Tart"
        },
        "-MiKA1AZOsbuNI8hiPgW" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMini%20Fruit%20Tart%2FImageimage%3A96?alt=media&token=b48eae9e-2f02-4a91-8f16-244bfca5ed14",
          "recipeName" : "Mini Fruit Tart"
        }
      },
      "Poha Rice" : {
        "-MiJl-xq1l1bcon3gtM7" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPoha%20Rice%2FImageimage%3A63?alt=media&token=69ca220b-fdde-4da9-859a-107ec9d46761",
          "recipeName" : "Poha Rice"
        },
        "-MiJl02GjOkl9uYSbdwI" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPoha%20Rice%2FImageimage%3A64?alt=media&token=7fa1105a-62c1-405f-9eff-e31c404f15bf",
          "recipeName" : "Poha Rice"
        },
        "-MiJl0D8FKMxkMqNsinN" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPoha%20Rice%2FImageimage%3A65?alt=media&token=3eb82424-a8dc-4a7d-a9c0-c66463cb20c1",
          "recipeName" : "Poha Rice"
        }
      },
      "Pot Southwestern Pasta" : {
        "-MiK1tVvAIv08aKMXhy_" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPot%20Southwestern%20Pasta%2FImageimage%3A87?alt=media&token=d408fdab-58b6-4bd3-b8a2-4bc0bd21f8b5",
          "recipeName" : "Pot Southwestern Pasta"
        },
        "-MiK1telQaGCPdixlgNE" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPot%20Southwestern%20Pasta%2FImageimage%3A86?alt=media&token=1cb79ce7-5969-45f1-b754-03e87b9d050b",
          "recipeName" : "Pot Southwestern Pasta"
        }
      },
      "Schezwan Noodles" : {
        "-MiK3MBSJnC_i3qsaQEf" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FSchezwan%20Noodles%2FImageimage%3A88?alt=media&token=fdda9b5c-2c92-404a-b628-21d174a1710c",
          "recipeName" : "Schezwan Noodles"
        }
      },
      "Thandai" : {
        "-MiK8phCbIsHOAnW35e1" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FThandai%2FImageimage%3A95?alt=media&token=d42ced28-3bb8-4183-86da-249cbec954bd",
          "recipeName" : "Thandai"
        },
        "-MiK8pj5tnVfWvk99hQK" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FThandai%2FImageimage%3A94?alt=media&token=eb0cdcd9-9ef2-4b4b-be38-6586f3973fa5",
          "recipeName" : "Thandai"
        },
        "-MiK8pwy9n6EC2uqzkAu" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FThandai%2FImageimage%3A93?alt=media&token=6086ad64-63ad-4e1d-8b47-b98b40677ed7",
          "recipeName" : "Thandai"
        }
      },
      "Upma Rava" : {
        "-MiJo4uiGFYE4qQGrcLp" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FUpma%20Rava%2FImageacc%3D1%3Bdoc%3D581?alt=media&token=ed3c14c4-3497-4a69-8146-a100420eb5ad",
          "recipeName" : "Upma Rava"
        }
      }
    },
    "NuxPL1bcAuUWmjpuEoVGC4vjjKS2" : {
      "Pancakes" : {
        "-MiKa_kBZdNUH-Pqx0M4" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FPancakes%2FImageimage%3A39758?alt=media&token=55e10f1d-9548-4d75-a350-aa48ae01c5a6",
          "recipeName" : "Pancakes"
        }
      }
    },
    "vwkNUIMU73QU2BIaltsXMcrSt0A2" : {
      "Apple Pie" : {
        "-MiJByw8CRDTcm3yatMw" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FApple%20Pie%2FImageimage%3A134159?alt=media&token=b5929a1e-e95a-4eab-b4f9-b249c19e037a",
          "recipeName" : "Apple Pie"
        }
      },
      "Baked Ricotta Cake" : {
        "-MiJBJCN1sOIVCL1Tyar" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBaked%20Ricotta%20Cake%2FImageimage%3A134158?alt=media&token=fdd59b8e-eef6-485e-854d-0c0e4648e550",
          "recipeName" : "Baked Ricotta Cake"
        }
      },
      "Blueberry Mint Cocktail" : {
        "-MiJC_xz2qa-SSmLLuiV" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBlueberry%20Mint%20Cocktail%2FImageimage%3A134160?alt=media&token=4ed9a6ff-9949-4419-89ae-faa027f08dc7",
          "recipeName" : "Blueberry Mint Cocktail"
        }
      },
      "Chicken Parm Egg Rolls" : {
        "-MiJ9zs0OCodpzqK8Nqv" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FChicken%20Parm%20Egg%20Rolls%2FImageimage%3A134157?alt=media&token=8cf68df3-d3b6-475b-bc06-6b550d94ab76",
          "recipeName" : "Chicken Parm Egg Rolls"
        }
      },
      "Dal Makhni" : {
        "-MiJ6uIuP76x8Due2Ctq" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FDal%20Makhni%2FImageimage%3A134151?alt=media&token=1546890b-8ce2-4d0e-a923-a75496db0246",
          "recipeName" : "Dal Makhni"
        }
      },
      "Honey Garlic Glazed Salmon" : {
        "-MiJ7nSq18cnTRAPjNUp" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FHoney%20Garlic%20Glazed%20Salmon%2FImageimage%3A134152?alt=media&token=331a108a-d28a-43a5-9c68-6544d413e0d0",
          "recipeName" : "Honey Garlic Glazed Salmon"
        },
        "-MiJ7nVTGbJGbtPBZAcv" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FHoney%20Garlic%20Glazed%20Salmon%2FImageimage%3A134153?alt=media&token=39efa33a-fa84-48f6-bf16-2e856260be52",
          "recipeName" : "Honey Garlic Glazed Salmon"
        }
      },
      "Masala Tea" : {
        "-MiJ4yzYg-aYZ1uIQ7qK" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Tea%2FImageimage%3A134143?alt=media&token=bafae1c0-d00d-49b7-bcb5-ff5e4e9f4483",
          "recipeName" : "Masala Tea"
        },
        "-MiJ4z5NjKf2XS-0lo_P" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMasala%20Tea%2FImageimage%3A134144?alt=media&token=14dee98a-cb9a-4004-b50b-08fc81667671",
          "recipeName" : "Masala Tea"
        }
      },
      "Maska Bun" : {
        "-MiJ5sAuOaMeMq29oL8S" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMaska%20Bun%2FImageimage%3A134149?alt=media&token=24281813-1462-4908-99a3-5b2a47e5c2f4",
          "recipeName" : "Maska Bun"
        },
        "-MiJ5sC2LCW2TaBdHe9c" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMaska%20Bun%2FImageimage%3A134150?alt=media&token=434ade94-a55b-4814-8c35-dec326606fe7",
          "recipeName" : "Maska Bun"
        }
      },
      "Meggie" : {
        "-MiJ9RIfcMDEnQFVLAp9" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134155?alt=media&token=eda4e2d1-5f72-48db-a002-e558a29654a1",
          "recipeName" : "Meggie"
        },
        "-MiJ9RQqx172Qgn0kP-H" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134156?alt=media&token=f55d5b00-699d-422d-8996-34d6df31ef40",
          "recipeName" : "Meggie"
        },
        "-MiJ9RTrj-mQferU6MO7" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMeggie%2FImageimage%3A134154?alt=media&token=b0fe4dbf-eed4-4c29-979d-c9adda8085a8",
          "recipeName" : "Meggie"
        }
      }
    },
    "w5Qu04DZnsOtXzYeTGVk3b3gozj2" : {
      "Brownies" : {
        "-MiKenSu0CDNZ215Qmsg" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FBrownies%2FImageimage%3A39767?alt=media&token=d3717769-39f7-4025-81fa-c5b716929c55",
          "recipeName" : "Brownies"
        }
      },
      "Chickpea Salad Sandwiches" : {
        "-MiKcOGQkG9pkq3HVEwQ" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FChickpea%20Salad%20Sandwiches%2FImageimage%3A39761?alt=media&token=9c6d6934-5674-41e8-97ad-ec5a8f6e449f",
          "recipeName" : "Chickpea Salad Sandwiches"
        }
      },
      "Egg Curry" : {
        "-MiKdHiOrXLmYSaC8L7r" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FEgg%20Curry%2FImageimage%3A39764?alt=media&token=52169997-8016-4134-975a-fd0818efb744",
          "recipeName" : "Egg Curry"
        },
        "-MiKdHjx_Eynx0885HML" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FEgg%20Curry%2FImageimage%3A39765?alt=media&token=85521734-6d8d-4796-9925-24cdbf9ed6ba",
          "recipeName" : "Egg Curry"
        },
        "-MiKdHyYAPQJmT8K3KdE" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FEgg%20Curry%2FImageimage%3A39763?alt=media&token=2e107bc6-1f8f-4cf7-8ba6-bdc18585cc0e",
          "recipeName" : "Egg Curry"
        }
      },
      "Lemonade" : {
        "-MiKdrODKay5VccaHPMG" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FLemonade%2FImageimage%3A39766?alt=media&token=a7b2e245-0139-44ce-afda-6d762f8aee7f",
          "recipeName" : "Lemonade"
        }
      },
      "Mexican Chicken soup" : {
        "-MiKcgxINA4gWuGHzIxI" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FMexican%20Chicken%20soup%2FImageimage%3A39762?alt=media&token=bada9a4f-514e-4d67-a936-e4020e84709a",
          "recipeName" : "Mexican Chicken soup"
        }
      },
      "Oven baked omelet" : {
        "-MiKbyaqSev_OttstRyB" : {
          "recipeImageLink" : "https://firebasestorage.googleapis.com/v0/b/cookbook-c17d4.appspot.com/o/Recipe%20Images%2FOven%20baked%20omelet%2FImageimage%3A39759?alt=media&token=67eed627-b730-4f3f-bcdb-4a1c6e0fd9f1",
          "recipeName" : "Oven baked omelet"
        }
      }
    }
  },
  "User Recipe Ratings" : {
    "Masala Tea" : {
      "IUKcsosLqFhWyuOtagcogza25QJ2" : {
        "recipeName" : "Masala Tea",
        "recipeRatings" : "4.0"
      }
    },
    "idli" : {
      "IUKcsosLqFhWyuOtagcogza25QJ2" : {
        "recipeName" : "idli",
        "recipeRatings" : "4.5"
      }
    }
  },
  "recipe_chef's_names" : {
    "-MiJ4y_g1Ye1psOZM5Bz" : {
      "chefName" : "Varsha",
      "rName" : "Masala Tea"
    },
    "-MiJ5hj86uhKYOA5Awhe" : {
      "chefName" : "Anna Khan",
      "rName" : "idli"
    },
    "-MiJ5rrJ7KYVHV-sx6dc" : {
      "chefName" : "Pranav",
      "rName" : "Maska Bun"
    },
    "-MiJ6NaGE6trRksTyRQ2" : {
      "chefName" : "Kunak khanna",
      "rName" : "Sahi Paratha"
    },
    "-MiJ6tplAz8OQ8QB88LV" : {
      "chefName" : "Shah Rukh Khan",
      "rName" : "Dal Makhni"
    },
    "-MiJ6yTtQmI4VCTC2NnL" : {
      "chefName" : "Ranveer brar",
      "rName" : "panneer butter masala"
    },
    "-MiJ7_cd5DXVJBCRtfBk" : {
      "chefName" : "Rita ben",
      "rName" : "Aloo puri"
    },
    "-MiJ7n7gd_J-YyXRRcSl" : {
      "chefName" : "Gordan Ramsey",
      "rName" : "Honey Garlic Glazed Salmon\n"
    },
    "-MiJ85nPr0V9sOamUrvR" : {
      "chefName" : "Gauri Gupta",
      "rName" : "Grilled sandwich"
    },
    "-MiJ8d5r3WjIQbPj-HcR" : {
      "chefName" : "Karan",
      "rName" : "Masala Meggie. "
    },
    "-MiJ8gCe8vzNLT454Lv0" : {
      "chefName" : "Sahil",
      "rName" : "Coconut pudding"
    },
    "-MiJ9Qr20xWqgfYYR8FJ" : {
      "chefName" : "Raheem",
      "rName" : "Meggie"
    },
    "-MiJ9oEdlJMHYheAvHKz" : {
      "chefName" : "Tejas Don",
      "rName" : "classic caesar"
    },
    "-MiJ9zVeC4Dkz2JaK61P" : {
      "chefName" : "Lalit",
      "rName" : "Chicken Parm Egg Rolls"
    },
    "-MiJBImgSDOusYYCPTOE" : {
      "chefName" : "Sunny ",
      "rName" : "Baked Ricotta Cake"
    },
    "-MiJBY-ussQKF1BFWDhY" : {
      "chefName" : "Guru Govind lala",
      "rName" : "peanut butter cookies"
    },
    "-MiJByb7PrCbBK6TV430" : {
      "chefName" : "Darshan",
      "rName" : "Apple Pie"
    },
    "-MiJC_RX_-QyhZ6Y-8Sd" : {
      "chefName" : "Keshav",
      "rName" : "Blueberry Mint Cocktail"
    },
    "-MiJl-a8mL7L5Sq3mtlW" : {
      "chefName" : "Vyshu",
      "rName" : "Poha Rice"
    },
    "-MiJmq6AuURZUqFd-dpv" : {
      "chefName" : "Niharika",
      "rName" : "Upma Rava"
    },
    "-MiJo4PWa1WlsWsPRc5R" : {
      "chefName" : "Niharika",
      "rName" : "Upma Rava"
    },
    "-MiJpv6AUEhlInaYWpQR" : {
      "chefName" : "Harish ",
      "rName" : "Cinnamon Rolls"
    },
    "-MiJr6LVMkkj88oAw9pI" : {
      "chefName" : "Kranthi",
      "rName" : "Carrot Cake Cookies"
    },
    "-MiJy6wEa0kkK1ji-Pct" : {
      "chefName" : "Kranthi",
      "rName" : "Kaju Masala"
    },
    "-MiK-0HNJcFymn6iwK_G" : {
      "chefName" : "Nikesh",
      "rName" : "Kadai Chole"
    },
    "-MiK1tCiQcOwOE18MuvR" : {
      "chefName" : "Tiwari",
      "rName" : "Pot Southwestern Pasta"
    },
    "-MiK3LnfGAg8Ueyty0E9" : {
      "chefName" : "KIM",
      "rName" : "Schezwan Noodles"
    },
    "-MiK604pREy3bMueUTk2" : {
      "chefName" : "Sagar Kapoor",
      "rName" : "Masala Cashew"
    },
    "-MiK7INkWVOquLqfTDrx" : {
      "chefName" : "Jagjith",
      "rName" : "Badami Milk"
    },
    "-MiK8pIetux6n7xu_vzZ" : {
      "chefName" : "Baby",
      "rName" : "Thandai"
    },
    "-MiKA0qQfqJdEK4wtiFp" : {
      "chefName" : "Monesh",
      "rName" : "Mini Fruit Tart"
    },
    "-MiKYfYOUC5WV31gF02S" : {
      "chefName" : "gurubai mehat",
      "rName" : "Rava laddu"
    },
    "-MiKZLz2AN21ekln0i-Z" : {
      "chefName" : "Allu arjun",
      "rName" : "Milk powder burfi"
    },
    "-MiKa_NMm2W_eAV-TbuH" : {
      "chefName" : "Ratan",
      "rName" : "Pancakes"
    },
    "-MiKbyBmmqxEhbM0OrB3" : {
      "chefName" : "Omel Banin",
      "rName" : "Oven baked omelet"
    },
    "-MiKcNqssg2AqFB-CIfm" : {
      "chefName" : "Omerta",
      "rName" : "Chickpea Salad Sandwiches"
    },
    "-MiKcgak5F7f-KFai7RM" : {
      "chefName" : "Kyle Kumar",
      "rName" : "Mexican Chicken soup"
    },
    "-MiKdHMVY3Zzxf5zuq2U" : {
      "chefName" : "Dhiru baba",
      "rName" : "Egg Curry"
    },
    "-MiKdr4w6It4VXrHra41" : {
      "chefName" : "Meethesh",
      "rName" : "Lemonade"
    },
    "-MiKen4CPIzujXKnMQY7" : {
      "chefName" : "Budha lal Chuno",
      "rName" : "Brownies"
    }
  }
}
